draft.org
#+STARTUP: showeverything


#+OPTIONS: ^:{} toc:0 num:nil

* Introduction

Hi. I'm Joe DeVivo and I'm here to talk about HTTP/2 in Erlang. We're
not going to get to it all. I cut tons from this talk. Hopefully I can
give you all enough context to go learn more. So which should I talk
about first?

** Why HTTP/2?

HTTP/2 is the future. It's coming and there's no stopping it. I
actually haven't even used HTTP/1 in months. Hahaha, just
kidding. HTTP/1 will be around for a long time.

The actual 'Why?' is efficiency. HTTP was built for TEXT by physicists
who wanted to share academic papers and thought it would be cool if
they could "link" their references to the actual reference.

Then we started using it for EVERYTHING. Images, javascripts, videos,
you name it, it could be sent over HTTP. And it was clunky at first. I
rolled up on the world wide web in the mid 1990's and I had 90's web
problems. If you were there too, you remember "broken jpgs". You might
also remember that thing where the page loaded in black and white,
with the default font and then suddenly the style got applied
retroactively. Shout out to underconstruction.gif

But eventually that stopped because the protocol improved with
HTTP/1.1, right?

WRONG! While HTTP/1.1 made some attempts at solving things like this
(e.g. Pipelining), this problem really got solved by throwing tons of
bandwidth at the problem. Perceived latency went down as the masses,
myself included, got access to broadband.

Is this solution enough then? Nope. Why not? Because slower
connections are back in a big way with mobile devices, edge networks
throughout the developing world, and not to mention the "internet of
things".

So, enter HTTP/2. If you only remember one thing about HTTP/2,
remember that it's stingy. Why use two bits when one will do. HTTP/2
wants to optimize how we use the wire. That also means taking
advantage of a persistent TCP connection, instead of opening a new one
for every resource.

It changes how efficiently we use the wire without changing HTTP/1.1's
semantics.

** Why Erlang?

The really short answer is that I'm an Erlanger. I've been working
with Erlang web technologies, and saw that Erlang would eventually
have a need for an HTTP/2 server, (and client for that matter). So,
"because I love Erlang" was reason enough for me, but you're not
me. Are you?

In case you weren't sure; No, you're not. So let me talk a bit about
why I like Erlang.

*** It's functional!

You all like functional languages right? When I first stared using
Erlang and it was hard to get into. Once I did, I found it easier to
express myself simply, especially with Pattern Matching

*** Pattern Matching

Oh, I love pattern matching. Maybe show an example here.

**** Pattern Matching a function clause

#+BEGIN_SRC erlang
int_to_string(0) ->
    "ZERO!";
int_to_string(1) ->
    "the loneliest number";
int_to_string(2) ->
    "two";
int_to_string(3) ->
    "III";
int_to_string(SomeInt) ->
    integer_to_list(SomeInt).
#+END_SRC

Basically, this lets us set up specific cases, and catch alls. Also,
if you caught it up there, I'm using erlang's integer_to_list
function. Because strings in Erlang are lists. Sometimes that's
awesome and sometimes it's not. I promise, if you get into Erlang, you
will at some point tableflip over this.

People get hung up on Erlang's punctuation. To me it just seems like
English. You have this idea (or "clause") but it's not complete. So
you "end" it with a semicolon and keep going. When the idea is
complete, you end it with a period instead.

*** Concurrency

Have you ever "slapped some concurrency" on a Java application? It's
easy right? Just sub java.util.HashMap for
java.util.concurrent.ConcurrentHashMap and you're done right?

Erlang is really into concurrency and high availability. It was
originally designed to run ericsson's telcom switches. So while a lot
of languages, like Java, had concurrency bolted on after the fact,
it's always been at Erlang's core.

Erlang rocks the actor model for concurrency. Each actor lives in its
own little world, it can receive messages from the outside, which it
can then modify its world view based on. It can send it's own messages
out into the world, and it can even create new actors.

In Erlang, the actors are processes, and it's extremely easy to spin
up a new one. Making that new one interesting is more of a challenge,
but Erlang gives you some of that for free too, and we're going to get
up in that soon.

*** Links and Monitors

When an Erlang process creates another process, it can also create a
link to that process and monitor it. What that means is that basically
if the child process crashes, the parent will get notified. This is
key to Erlang's "let it crash" philosophy which basically celebrates
the fact that's pretty easy to just start a replacement process if
things go wrong.

*** OTP

OTP is the Open Telcom Platform. It's a set of standard libraries that
come with Erlang. "Telcom" is a throwback to when Erlang was built for
telephone switches.  To be honest, I don't think it's even possible to
get Erlang without OTP; however, with alternative languages for the
Erlang VM like Elixir, it might be possible to get OTP without
Erlang. Well, I mean, I'm not sure you can have Elixir without Erlang,
since Exlir compiles to Erlang, so who knows?

The point is, the line is very blurry. However, I am pretty sure that
up until now I've just talked about Erlang.

OTP gives us some behaviors to make working with the Actor model and
process supervision easier

*** The Supervisor

In my HTTP/2 server, chatterbox, I have one supervisor, which is an
OTP provided behavior.  It's a pretty simple one at that. I pretty
much got it almost verbatim from Learn You Some Erlang, which is a
great resource.

What it's doing is setting up a socket to listen on whatever
port. Then spawns N processes to sit there trying to accept
connections. When a connection comes in, one of those processes snags
it and starts doing stuff.

Erlang has all sorts of cool ways of handling processes, but we're
going to use "simple one for one" here. Simple one for one allows us
to share the listener socket across all the children, and is totally
cool when a child process terminates. It's also pretty cool with lots
of children, all of which are the same kind of thing. It's a good
choice for a web server.

We spawn all these children as "temporary" which is telling the Erlang
VM, don't worry if this one crashes, another client will connect,
starting everything over again.

