draft.html

<div id="outline-container-orgheadline11" class="outline-4">
<h4 id="orgheadline11">Generic Finite State Machine</h4>
<div class="outline-text-4" id="text-orgheadline11">
<p>
We talked a bit before about an actor having a "world view". Usually,
it's just its internal perspective. So the actor should have some kind
of state. OTP gives us this behavior called gen_fsm, which is like
"Bring your own state and transitions" process. You tell it how to
start up, what things make up the state and how to react to different
message types and that's it. OTP takes care of actually sending and
receiving those messages.
</p>

<p>
What we want to do, is write an fsm that accepts something off the
listener socket we specified in the supervisor, and then start
interacting with the packets coming in over that connection. So we
implement a gen_fsm, and tell the supervisor to start a bunch of
them.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12">Let's Apply some of this to HTTP/2</h2>
<div class="outline-text-2" id="text-orgheadline12">
<p>
We touched on only using one TCP connection for HTTP/2 requests,
We can create a place in the gen_fsm's state where we keep the TCP
socket, but that's not all we need, let's go back to the protocol.
</p>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-2">
<h2 id="orgheadline13">HTTP/2 Connections</h2>
<div class="outline-text-2" id="text-orgheadline13">
<p>
An HTTP/2 connection remains persistent between requests, and while
HTTP/2 remains a stateless protocol, the connection maintains some
state in the spirit of stinginess over the wire. So, we'll write a
server process that maintains this in its state, but allows us to
process individual requests in a stateless fashion.
</p>

<p>
How can we do that? The HTTP/2 spec explains it!
</p>

<p>
HTTP/2 uses multiplexed streams. These streams represent at most ONE
request, which is semantically identical to an HTTP/1 request. So how
do these streams work? What are they even for?
</p>
</div>

<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14">Frames</h3>
<div class="outline-text-3" id="text-orgheadline14">
<p>
Let's go down to the 'atomic' level of HTTP/2. The smallest thing
there is, is a frame. Well, is an atom the smallest thing. I guess
not. I think the simile holds, because a frame is made up of a frame
header and a frame payload. These are two smaller things, but if we
ever broke them up, everything would pretty much explode.
</p>

<p>
For right now, the most interesting thing about a frame header is that
it contains a 31 bit stream identifier. So, the frame knows what
stream it's a part of.
</p>
</div>
</div>

<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15">Streams</h3>
<div class="outline-text-3" id="text-orgheadline15">
<p>
So what's a stream? It's a logical abstraction over a
connection. Physically, it's a sequence of frames. Where the
connection is also a sequence of frames, the connection is THE
sequence of frames. A stream is filtered by the ID. Most of them look
like a series of frames sent by the client representing a request, and
then a series of frames sent by the server representing the response.
</p>
</div>
</div>

<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16">Stream 0</h3>
<div class="outline-text-3" id="text-orgheadline16">
<p>
Stream 0 is reserved for connection level frames. The meta-stream, as
it were.
</p>
</div>
</div>

<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17">Connection State</h3>
<div class="outline-text-3" id="text-orgheadline17">
<p>
Streams are our old-fangled web requests and responses, and they're
stateless like good semantically identical messages should be. So,
let's talk about this connection thing and it's state.
</p>

<p>
I already said that we're going to keep the TCP socket in the
connection's state. The spec doesn't actually explicitly say we have
to, but I can't imagine an implementation that doesn't. The spec does
say that we have to keep track of some things. Let's start with the
connection settings.
</p>
</div>
</div>

<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18">SETTINGS</h3>
<div class="outline-text-3" id="text-orgheadline18">
<p>
An HTTP/2 connection has six settings that affect it.
</p>

<ul class="org-ul">
<li>SETTINGS_HEADER_TABLE_SIZE</li>
<li>SETTINGS_ENABLE_PUSH</li>
<li>SETTINGS_MAX_CONCURRENT_STREAMS</li>
<li>SETTINGS_INITIAL_WINDOW_SIZE</li>
<li>SETTINGS_MAX_FRAME_SIZE</li>
<li>SETTINGS_MAX_HEADER_LIST_SIZE</li>
</ul>

<p>
A server and client both send values for these settings to each other
when they initially connect, and need to maintain these values in
state for the duration of the connection, although they can agree to
change them later in the connection if they want to.
</p>
</div>

<div id="outline-container-orgheadline19" class="outline-4">
<h4 id="orgheadline19">HEADER_TABLE_SIZE</h4>
<div class="outline-text-4" id="text-orgheadline19">
<p>
What's "HEADER_TABLE_SIZE"? It's the maximum size that the header
table can take up in memory. What's the header table? Well, this is
where HPACK comes into the picture. I could do a whole talk on HPACK,
and I have! Go check out the video of my LambdaJam 2015 talk
here. [link].
</p>

<p>
The short version is that in order to save space on the wire, an
HTTP/2 client maintains a cache of headers it has sent, and the server
maintains a cache of headers it has received. Then the next time the
client sends that header, it can send an index for the header and the
server will be using the same index, so less bytes! Guess where this
cache lives? That's right! It's the connection state. Oh and hey,
they're different caches for requests and responses, so the client and
server actually keep two caches in the state.
</p>

<p>
Are you already thinking about race conditions? If you're not, it's
because I haven't explained the details of an HPACK implementation
well enough here, nor do I have time to. I promise we'll talk about
the race condition tho. Just not right now.
</p>
</div>
</div>

<div id="outline-container-orgheadline20" class="outline-4">
<h4 id="orgheadline20">ENABLE_PUSH</h4>
<div class="outline-text-4" id="text-orgheadline20">
<p>
This turns on push promises which are super cool, and it's a shame I'm
going to gloss over them for now. Just imagine that you can send
multiple responses to a single request. That's what push promises
are. So if you're asked for HTML, you can respond with the HTML, CSS,
JavaScript, and even images, that your HTML references.
</p>
</div>
</div>

<div id="outline-container-orgheadline21" class="outline-4">
<h4 id="orgheadline21">MAX_CONCURRENT_STREAMS</h4>
<div class="outline-text-4" id="text-orgheadline21">
<p>
I touched briefly on the idea of streams. What we didn't talk about is
that a stream is also a finite state machine. [Show it on a
slide]. There are rules for what type of frame can come in while a
stream is in a particular state and rules for what events transition
into different states.
</p>

<p>
Did I mention that frames have types? There are ten types and a
frame's type is specified in the frame header. Isn't that exciting?
You now know half of the things in the frame header, so don't say I
didn't teach you something.
</p>

<p>
All 2^31 - 1 streams begin in the 'idle' state, and when they're done,
they end up 'closed'. Max concurrent streams sets a cap for how many
streams can be in the other five states at any given time.
</p>
</div>
</div>

<div id="outline-container-orgheadline22" class="outline-4">
<h4 id="orgheadline22">INITIAL_WINDOW_SIZE</h4>
<div class="outline-text-4" id="text-orgheadline22">
<p>
Initial window size? HTTP/2 brings flow control to HTTP. It allows the
client and server to both set limits about how much data they're
willing to accept. The good news here is that it only applies to DATA
frames, which means "Request and Response bodies". Frames that tell
the connection what to do with itself are exempt from flow control and
can still get through.
</p>

<p>
The initial window size is how much byte credit this connection
has. The good news is that we're in charge of the credit limits, so if
we receive ten bytes, the available credit goes down ten, but we can
just extend the credit another ten. This allows us, as the server to
receive bytes, keep them in memory, do stuff with them, throw them
away, and then at that point issue more credit. This way, we use a
finite amount of memory.
</p>

<p>
BTW, issuing credit is done with a WINDOW_UPDATE frame, and can be
done at the connection or stream level.
</p>
</div>
</div>
