draft.org
*** MAX_FRAME_SIZE

OMG Frame payloads have size. A frame header contains a frame length
which lets you know, after the header is over, how many of the
following bytes before the next header. You're now 3 quarters of the
way to knowing everything you need to know about frame headers, but
that last quarter is the most complicated. This setting says what the
maximum value for frame length can be.

*** MAX_HEADER_LIST_SIZE

Max header list size sounds like the same as HEADERS_TABLE_SIZE, but
this is at the stream level and is basically a cap for how much
headers data can be sent in a single request.

** Settings Redux

Wow. In explaining these six settings, I think I got through a sizable
chuck of the protocol. We talked about multiplexing, flow control,
header compression, and server push! And that was just to set the
stage for connection state.

We'll need to store all six of these settings in the connection state,
but they also imply even more state.

We'll have to have a way of tracking:

- how many streams are active
- what our current credit balance is at the connection level
- what our current credit balance is at the stream level
- a cache of request headers received (decode context)
- a cache of response headers sent (encode context)

By the way, each peer can have different values for these settings, so
we'll actually need to keep track of the server's to know what we can
receive and the client's to know what we can send.

So we can store these all in an Erlang state record.

* Gen_fsm State

I mentioned before that gen_fsm takes care of all the messy stuff
so you can bring your own state. Well, now we know what we want our
state to be. Of course, we have the option to change it, and in real
life I just added one of these at a time as I tried to implement
little slices of the spec.

While Erlang seems to be moving away from this, I took the traditional
route of declaring a record for my connection state.

Records are a kind of hackey struct in Erlang. You declare one like this:

#+BEGIN_SRC erlang
-record(connection_state, {socket, max_frame_size}).
#+END_SRC

But Erlang just treats it as a tuple like

#+BEGIN_SRC erlang
{connection_state, Socket, MaxFrameSize}.
#+END_SRC

With some syntactic sugar:

#+BEGIN_SRC erlang
ConnectionState#connection_state.socket.
%% Which is basically
element(2, ConnectionState).
%% Which can also be a pattern match
{connection_state, Socket, _} = ConnectionState.


%% Direct Access
Socket = ConnectionState#connection_state.socket.
%% Pattern Matching
#connection_state{socket=Socket} = ConnectionState.
%% Create a modified copy
NewConnectionState
    = ConnectionState#connection_state{socket=NewSocket}.


#+END_SRC

The only difference is that if I change the record declaration later,
the first method of accessing it still works, unless I change the
record so "socket" isn't a thing anymore.

The second way breaks if I move the order of things.

The third way breaks if I change the order of things OR the number of fields.

The point is that records can be brittle, but I'm used to them. Maps
seem like the future, but when I started this project, the
implementation was incomplete. It's not incomplete now, so give them a
shot :D

* Gen_fsm callbacks

Gen_fsm does the heavy lifting, but you do have to write some code you
know? In a gen_fsm's life cycle, there are six callbacks that we'll
need to define, even if they don't wind up doing anything. there's
also callbacks that need to be defined for each state, but we're
getting ahead of ourselves.

