draft.html

<div id="outline-container-orgheadline23" class="outline-4">
<h4 id="orgheadline23">MAX_FRAME_SIZE</h4>
<div class="outline-text-4" id="text-orgheadline23">
<p>
OMG Frame payloads have size. A frame header contains a frame length
which lets you know, after the header is over, how many of the
following bytes before the next header. You're now 3 quarters of the
way to knowing everything you need to know about frame headers, but
that last quarter is the most complicated. This setting says what the
maximum value for frame length can be.
</p>
</div>
</div>

<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24">MAX_HEADER_LIST_SIZE</h4>
<div class="outline-text-4" id="text-orgheadline24">
<p>
Max header list size sounds like the same as HEADERS_TABLE_SIZE, but
this is at the stream level and is basically a cap for how much
headers data can be sent in a single request.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-3">
<h3 id="orgheadline25">Settings Redux</h3>
<div class="outline-text-3" id="text-orgheadline25">
<p>
Wow. In explaining these six settings, I think I got through a sizable
chuck of the protocol. We talked about multiplexing, flow control,
header compression, and server push! And that was just to set the
stage for connection state.
</p>

<p>
We'll need to store all six of these settings in the connection state,
but they also imply even more state.
</p>

<p>
We'll have to have a way of tracking:
</p>

<ul class="org-ul">
<li>how many streams are active</li>
<li>what our current credit balance is at the connection level</li>
<li>what our current credit balance is at the stream level</li>
<li>a cache of request headers received (decode context)</li>
<li>a cache of response headers sent (encode context)</li>
</ul>

<p>
By the way, each peer can have different values for these settings, so
we'll actually need to keep track of the server's to know what we can
receive and the client's to know what we can send.
</p>

<p>
So we can store these all in an Erlang state record.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline26" class="outline-2">
<h2 id="orgheadline26">Gen_fsm State</h2>
<div class="outline-text-2" id="text-orgheadline26">
<p>
I mentioned before that gen_fsm takes care of all the messy stuff
so you can bring your own state. Well, now we know what we want our
state to be. Of course, we have the option to change it, and in real
life I just added one of these at a time as I tried to implement
little slices of the spec.
</p>

<p>
While Erlang seems to be moving away from this, I took the traditional
route of declaring a record for my connection state.
</p>

<p>
Records are a kind of hackey struct in Erlang. You declare one like this:
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #8959a8;">-record</span>(<span style="color: #4271ae;">connection_state</span>, {socket, max_frame_size}).
</pre>
</div>

<p>
But Erlang just treats it as a tuple like
</p>

<div class="org-src-container">

<pre class="src src-erlang">{connection_state, <span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">MaxFrameSize</span>}.
</pre>
</div>

<p>
With some syntactic sugar:
</p>

<div class="org-src-container">

<pre class="src src-erlang">ConnectionState#<span style="color: #4271ae;">connection_state</span>.socket.
<span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Which is basically</span>
<span style="color: #f5871f;">element</span>(2, <span style="color: #eab700;">ConnectionState</span>).
<span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Which can also be a pattern match</span>
{connection_state, <span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">_</span>} = <span style="color: #eab700;">ConnectionState</span>.


<span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Direct Access</span>
<span style="color: #eab700;">Socket</span> = <span style="color: #eab700;">ConnectionState</span>#<span style="color: #4271ae;">connection_state</span>.socket.
<span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Pattern Matching</span>
#<span style="color: #4271ae;">connection_state</span>{socket=<span style="color: #eab700;">Socket</span>} = <span style="color: #eab700;">ConnectionState</span>.
<span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Create a modified copy</span>
<span style="color: #eab700;">NewConnectionState</span>
    = <span style="color: #eab700;">ConnectionState</span>#<span style="color: #4271ae;">connection_state</span>{socket=<span style="color: #eab700;">NewSocket</span>}.
</pre>
</div>

<p>
The only difference is that if I change the record declaration later,
the first method of accessing it still works, unless I change the
record so "socket" isn't a thing anymore.
</p>

<p>
The second way breaks if I move the order of things.
</p>

<p>
The third way breaks if I change the order of things OR the number of fields.
</p>

<p>
The point is that records can be brittle, but I'm used to them. Maps
seem like the future, but when I started this project, the
implementation was incomplete. It's not incomplete now, so give them a
shot :D
</p>
</div>
</div>

<div id="outline-container-orgheadline27" class="outline-2">
<h2 id="orgheadline27">Gen_fsm callbacks</h2>
<div class="outline-text-2" id="text-orgheadline27">
<p>
Gen_fsm does the heavy lifting, but you do have to write some code you
know? In a gen_fsm's life cycle, there are six callbacks that we'll
need to define, even if they don't wind up doing anything. there's
also callbacks that need to be defined for each state, but we're
getting ahead of ourselves.
</p>
</div>
