draft.org
** init/1

init runs one time on start up. It takes anything as an argument, but
usually it's a list. Even if you have nothing to tell it, it'll take
the empty list `[]`.

Remember when we spawned a bunch of processes to listen on a
socket. These are they, and init is being passed a socket for it to
toss in to the state.

init/1 returns the initial state of the server. It goes a little
something like this, hit it!

#+BEGIN_SRC erlang
init([{Transport, ListenSocket}, SSLOptions]) ->
    {ok, Ref} = prim_inet:async_accept(ListenSocket, -1),
    {ok,
     accept,
     #connection_state{
        listen_ref=Ref,
        socket = {Transport, undefined},
        ssl_options = SSLOptions
        }}.
#+END_SRC

What we're saying here is to go ahead and just spawn an acceptor
somewhere. When a connection comes along we'll get a process message
that let's us know and we'll deal with it then. We'll store some of
this information in the FSM's state, and then transition into the
accept state, where we wait for a client to come along.


handle_info/2 is for messages that are not managed by the gen_fsm
messaging API. An example of this has to do with the socket we just
opened. If it closes unexpectedly, it will send a message to our
gen_fsm (isn't Erlang cool?) and since it's not a normal
gen_fsmy message, we need a handle_info callback clause to deal
with it.

#+BEGIN_SRC erlang
handle_info({tcp_closed, _Socket}, _StateName, State) ->
    {stop, normal, S};
#+END_SRC

{tcp_closed, _Socket} is the message, and State is the actual server
state. We could do something with this if we were trying to salvage
the process, but since the socket being closed means this connection
is done with, we just stop the server.

#+BEGIN_SRC erlang
handle_info({inet_async, _ListSock, Ref, {ok, CliSocket}},
    accept,
    S=#connection_state{
        ssl_options = SSLOptions,
        socket = {Transport, undefined},
        listen_ref = Ref
    }) ->
    inet_db:register_socket(CliSocket, inet_tcp),
    Socket = case Transport of
        gen_tcp ->
            CliSocket;
        ssl ->
            {ok, AcceptSocket} = ssl:ssl_accept(CliSocket, SSLOptions),
            %% TODO: Erlang 18 uses ALPN
            {ok, _Upgrayedd} = ssl:negotiated_next_protocol(AcceptSocket),
            AcceptSocket
        end,
    chatterbox_sup:start_socket(),

    {next_state,
     handshake,
     S#connection_state{
       socket = {Transport, Socket}
     },
     0};
#+END_SRC

"Transport" tells us if we're going to use the `gen_tcp` or `ssl`
module for handling sockets. After the setup they're pretty much the
same, so let's just assume we're using `gen_tcp` from here on out. so
the slides are easier to read.

We open up another process for listening on the Listener socket, so
there's always something ready to accept new connections.

After this socket accepting is done, we store the socket in the FSM
state and transtition into the `handshake` state.


** StateName Callbacks

StateName/2 and StateName/3. They're pretty much the same. They both
receive a message and and then transition into another state. The only
difference is that the `/3` sends a response. `/2` doesn't need one.

Then we define a function that explains to gen_fsm what to do when it
times out in the a handshake state. This is our first example of the
StateName/2 callback.

[Note: accept didn't need one, since it was triggered by handle_info]

StateName/2 needs to return one of 4 results:
#+BEGIN_SRC erlang
{next_state,NextStateName,NewStateData}
{next_state,NextStateName,NewStateData,Timeout}
{next_state,NextStateName,NewStateData,hibernate}
{stop,Reason,NewStateData}
#+END_SRC

But we're most interested in the second and last. Let's talk about the
last real quick. It stops things if we find an error. HTTP/2 has a way
to close the connection if we find an error too!

#+BEGIN_SRC erlang
handshake(timeout,
          StateWithSocket=#connection_state{
            socket={Transport, Socket}
          }) ->
    case Transport:recv(AcceptSocket, 24, 5000) of
        {ok, <<"PRI * HTTP/2.0\r\n\r\nSM\r\n\r\n">>} ->
            {next_state, connected, StateWithSocket, 0};
        _ ->
            {next_state, closing, StateWithSocket, 0}
    end.
#+END_SRC

