draft.html

<div id="outline-container-orgheadline28" class="outline-3">
<h3 id="orgheadline28">init/1</h3>
<div class="outline-text-3" id="text-orgheadline28">
<p>
init runs one time on start up. It takes anything as an argument, but
usually it's a list. Even if you have nothing to tell it, it'll take
the empty list `[]`.
</p>

<p>
Remember when we spawned a bunch of processes to listen on a
socket. These are they, and init is being passed a socket for it to
toss in to the state.
</p>

<p>
init/1 returns the initial state of the server. It goes a little
something like this, hit it!
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">init</span>([{<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">ListenSocket</span>}, <span style="color: #eab700;">SSLOptions</span>]) -&gt;
    {ok, <span style="color: #eab700;">Ref</span>} = <span style="color: #4271ae;">prim_inet</span>:<span style="color: #4271ae;">async_accept</span>(<span style="color: #eab700;">ListenSocket</span>, -1),
    {ok,
     accept,
     #<span style="color: #4271ae;">connection_state</span>{
        listen_ref=<span style="color: #eab700;">Ref</span>,
        socket = {<span style="color: #eab700;">Transport</span>, undefined},
        ssl_options = <span style="color: #eab700;">SSLOptions</span>
        }}.
</pre>
</div>

<p>
What we're saying here is to go ahead and just spawn an acceptor
somewhere. When a connection comes along we'll get a process message
that let's us know and we'll deal with it then. We'll store some of
this information in the FSM's state, and then transition into the
accept state, where we wait for a client to come along.
</p>


<p>
handle_info/2 is for messages that are not managed by the gen_fsm
messaging API. An example of this has to do with the socket we just
opened. If it closes unexpectedly, it will send a message to our
gen_fsm (isn't Erlang cool?) and since it's not a normal
gen_fsmy message, we need a handle_info callback clause to deal
with it.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">handle_info</span>({tcp_closed, <span style="color: #eab700;">_Socket</span>}, <span style="color: #eab700;">_StateName</span>, <span style="color: #eab700;">State</span>) -&gt;
    {stop, normal, <span style="color: #eab700;">S</span>};
</pre>
</div>

<p>
{tcp_closed, _Socket} is the message, and State is the actual server
state. We could do something with this if we were trying to salvage
the process, but since the socket being closed means this connection
is done with, we just stop the server.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">handle_info</span>({inet_async, <span style="color: #eab700;">_ListSock</span>, <span style="color: #eab700;">Ref</span>, {ok, <span style="color: #eab700;">CliSocket</span>}},
    accept,
    <span style="color: #eab700;">S</span>=#<span style="color: #4271ae;">connection_state</span>{
        ssl_options = <span style="color: #eab700;">SSLOptions</span>,
        socket = {<span style="color: #eab700;">Transport</span>, undefined},
        listen_ref = <span style="color: #eab700;">Ref</span>
    }) -&gt;
    <span style="color: #4271ae;">inet_db</span>:<span style="color: #4271ae;">register_socket</span>(<span style="color: #eab700;">CliSocket</span>, inet_tcp),
    <span style="color: #eab700;">Socket</span> = <span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span> <span style="color: #718c00;">of</span>
        gen_tcp -&gt;
            <span style="color: #eab700;">CliSocket</span>;
        ssl -&gt;
            {ok, <span style="color: #eab700;">AcceptSocket</span>} = <span style="color: #4271ae;">ssl</span>:<span style="color: #4271ae;">ssl_accept</span>(<span style="color: #eab700;">CliSocket</span>, <span style="color: #eab700;">SSLOptions</span>),
            <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">TODO: Erlang 18 uses ALPN</span>
            {ok, <span style="color: #eab700;">_Upgrayedd</span>} = <span style="color: #4271ae;">ssl</span>:<span style="color: #4271ae;">negotiated_next_protocol</span>(<span style="color: #eab700;">AcceptSocket</span>),
            <span style="color: #eab700;">AcceptSocket</span>
        <span style="color: #718c00;">end</span>,
    <span style="color: #4271ae;">chatterbox_sup</span>:<span style="color: #4271ae;">start_socket</span>(),

    {next_state,
     handshake,
     <span style="color: #eab700;">S</span>#<span style="color: #4271ae;">connection_state</span>{
       socket = {<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">Socket</span>}
     },
     0};
</pre>
</div>

<p>
"Transport" tells us if we're going to use the `gen_tcp` or `ssl`
module for handling sockets. After the setup they're pretty much the
same, so let's just assume we're using `gen_tcp` from here on out. so
the slides are easier to read.
</p>

<p>
We open up another process for listening on the Listener socket, so
there's always something ready to accept new connections.
</p>

<p>
After this socket accepting is done, we store the socket in the FSM
state and transtition into the `handshake` state.
</p>
</div>
</div>


<div id="outline-container-orgheadline29" class="outline-3">
<h3 id="orgheadline29">StateName Callbacks</h3>
<div class="outline-text-3" id="text-orgheadline29">
<p>
StateName/2 and StateName/3. They're pretty much the same. They both
receive a message and and then transition into another state. The only
difference is that the `/3` sends a response. `/2` doesn't need one.
</p>

<p>
Then we define a function that explains to gen_fsm what to do when it
times out in the a handshake state. This is our first example of the
StateName/2 callback.
</p>

<p>
[Note: accept didn't need one, since it was triggered by handle_info]
</p>

<p>
StateName/2 needs to return one of 4 results:
</p>
<div class="org-src-container">

<pre class="src src-erlang">{next_state,<span style="color: #eab700;">NextStateName</span>,<span style="color: #eab700;">NewStateData</span>}
{next_state,<span style="color: #eab700;">NextStateName</span>,<span style="color: #eab700;">NewStateData</span>,<span style="color: #eab700;">Timeout</span>}
{next_state,<span style="color: #eab700;">NextStateName</span>,<span style="color: #eab700;">NewStateData</span>,hibernate}
{stop,<span style="color: #eab700;">Reason</span>,<span style="color: #eab700;">NewStateData</span>}
</pre>
</div>

<p>
But we're most interested in the second and last. Let's talk about the
last real quick. It stops things if we find an error. HTTP/2 has a way
to close the connection if we find an error too!
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">handshake</span>(timeout,
          <span style="color: #eab700;">StateWithSocket</span>=#<span style="color: #4271ae;">connection_state</span>{
            socket={<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">Socket</span>}
          }) -&gt;
    <span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">AcceptSocket</span>, 24, 5000) <span style="color: #718c00;">of</span>
        {ok, &lt;&lt;<span style="color: #3e999f;">"PRI * HTTP/2.0\r\n\r\nSM\r\n\r\n"</span>&gt;&gt;} -&gt;
            {next_state, connected, <span style="color: #eab700;">StateWithSocket</span>, 0};
        <span style="color: #eab700;">_</span> -&gt;
            {next_state, closing, <span style="color: #eab700;">StateWithSocket</span>, 0}
    <span style="color: #718c00;">end</span>.
</pre>
</div>
</div>
</div>
