draft.org
** GO AWAY

There's an HTTP/2 Frame called "go away" that tells the connection
that we can't recover. There are lots of reasons this could happen,
and some of them even have specific codes!

We'll write a function for that:

#+BEGIN_SRC erlang
go_away(ErrorCode,
         State = #connection_state{
                   socket={Transport,Socket},
                    next_available_stream_id=NAS
                  }) ->
    GoAway = #goaway{
                last_stream_id=NAS,
                error_code=ErrorCode
               },
    GoAwayBin = http2_frame:to_binary({#frame_header{
                                          stream_id=0
                                         }, GoAway}),
    Transport:send(Socket, GoAwayBin),
    {next_state, closing, State, 0}.
#+END_SRC

It will actually send to go_away frame and then transition into the
`closing`, which might look like this.



#+BEGIN_SRC erlang
closing(Message, State=#connection_state{
        socket={_, undefined}
    }) ->
    %% Does nothing if socket is undefined
    {stop, normal, State};
closing(Message, State=#connection_state{
        socket={Transport, Socket}
    }) ->
    %% Closes the socket otherwise
    Transport:close(Socket),
    {stop, normal, State}.
#+END_SRC

We add another clause to cover if we don't have a socket set yet, so
it will do everything but close the socket.

So our go_away function effectively closes the connection with a
reason. We're going to use it if we have any problems establishing the
connection in the accept state.

#+BEGIN_SRC erlang
handshake(timeout,
          StateWithSocket=#connection_state{
            socket={Transport, Socket}
          }) ->
#+END_SRC

And now we have an FSM just sitting around with an open socket. Just
opening a socket's never been so easy! Now what?

We still need to start the connection. Fortunately for us, every
HTTP/2 connection begins with a preamble: "PRI *
HTTP/2.0\r\n\r\nSM\r\n\r\n". It's 24 characters of fried gold. Let's
ask for it immediately:

#+BEGIN_SRC erlang
{ok, <<"PRI * HTTP/2.0\r\n\r\nSM\r\n\r\n">>}
    = Transport:recv(AcceptSocket, 24, 5000),
{next_state, connected, StateWithSocket, 0}.
#+END_SRC

Those carets around the string means it's a binary! Let's go ahead and
store that accepted socket in the state and transition into the
connected state where we'll read frames.

but what if that doesn't come over? Well, this thing will explode,
which I guess is ok since we're never going to do our job as an HTTP/2
server anyway, but we don't have to be obnoxious about it.

#+BEGIN_SRC erlang
case Transport:recv(Socket, length(?PREAMBLE), 5000) of
    {ok, <<<"PRI * HTTP/2.0\r\n\r\nSM\r\n\r\n">>} ->
        {next_state, connected, StateWithSocket, 0};
    _ ->
        go_away(?PROTOCOL_ERROR, StateWithSocket)
end.
#+END_SRC

That'll stop the server from doing anything when we know we're done
and actually closes the socket tidily.

Now we're started up. We've received this, everything else will be a
HTTP/2 frame. Another thing we know from the RFC, is that a frame
header will always be nine bytes. So let's look at some code to pull a
frame off the wire:

#+BEGIN_SRC erlang
{ok, FrameHeaderBin} = Transport:recv(Socket, 9),
FrameHeader = http2_frame:read_binary_frame_header(FrameHeaderBin),
{ok, FramePayloadBin} = Transport:recv(Socket, FrameHeader#frame_header.length),
#+END_SRC

We'll wrap it in something like
#+BEGIN_SRC erlang
http2_frame:read({Transport, Socket}, Timeout).
#+END_SRC

So you don't have to worry about it.

So what's the magic behind read_binary_frame_header?

#+BEGIN_SRC erlang
read_binary_frame_header(<<Length:24,Type:8,Flags:8,_R:1,StreamId:31,_Rem/bits>>) ->
    #frame_header{
        length = Length,
        type = Type,
        flags = Flags,
        stream_id = StreamId
    }.
#+END_SRC

Pattern matching is fun. See the carets around everything? This is a
binary. Notice those numbers! They're in bit counts not byte counts
because StreamId is 31 bits. My Sega Genesis was only 16 bits. The
`/bits` at the end is what makes this possible.

So great! We know the finite number of bytes to pull of wire to get a
frame. But this is a server, not a for loop. I mean, what's a for loop?

We basically need to write a `connected/2` callback for our gen_fsm to
handle a single frame on timeout.

The real fun is going to be in connected/2, because we're going to
read frames one at a time and process them.

#+BEGIN_SRC erlang
connected(timeout, State=#connection_state{
                            socket=Socket
                        }) ->
    {FrameHeader, Payload} = http2_frame:read(Socket),
    %% Do stuff, Maybe define "NewState" with an updated
    %% value for our remaining flow control credits maybe?
    route_frame({FrameHeader, Payload}, State).

-spec route_frame(http2_frame(), connection_state())
    -> {next_state,
        connected | continuation | closing,
        connection_state(),
        non_neg_integer()}.
route_frame(_, State) ->
    {next_state, connected, State, 0}.
#+END_SRC

The function clause is "yet another pattern match" which is looking
for this function to have two arguments: a message `next` and a
bound variable `State`. By bound, I mean we can use `State` anywhere
in the function body and it will mean this thing that was passed
in. Also, you can't change it!

After the hashmark, we're saying this is a connection_state
record. That means that if anything that's not an connection_state
record is passed in here, it won't match this clause. Since that is
our only clause, this will blow up on a `badmatch` if any other
message comes in.

We could add a catch all like this tho:

#+BEGIN_SRC erlang
connected(AnyMessage, AnythingButProbablyState) ->
    io:format("Unexpected message: ~p~n", [AnyMessage]),
    io:format("Unexpected state: ~p~n", [AnythingButProbablyState])
    {next_state, connected, AnythingButProbablyState, 0}.
#+END_SRC

io:format, it's like printf/puts/System.out.println for Erlang!

So this does nothing. Well, I refactored the frame reading code into
one function call, as you can imagine we're going to call it
alot. We'll "do stuff" later, but right now we need the skeleton of
the server in place, which is what this is. We're also going to have
it return the same return values that gen_fsm:StateName/2 would
return.

