draft.html

<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30">GO AWAY</h3>
<div class="outline-text-3" id="text-orgheadline30">
<p>
There's an HTTP/2 Frame called "go away" that tells the connection
that we can't recover. There are lots of reasons this could happen,
and some of them even have specific codes!
</p>

<p>
We'll write a function for that:
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">go_away</span>(<span style="color: #eab700;">ErrorCode</span>,
         <span style="color: #eab700;">State</span> = #<span style="color: #4271ae;">connection_state</span>{
                   socket={<span style="color: #eab700;">Transport</span>,<span style="color: #eab700;">Socket</span>},
                    next_available_stream_id=<span style="color: #eab700;">NAS</span>
                  }) -&gt;
    <span style="color: #eab700;">GoAway</span> = #<span style="color: #4271ae;">goaway</span>{
                last_stream_id=<span style="color: #eab700;">NAS</span>,
                error_code=<span style="color: #eab700;">ErrorCode</span>
               },
    <span style="color: #eab700;">GoAwayBin</span> = <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">to_binary</span>({#<span style="color: #4271ae;">frame_header</span>{
                                          stream_id=0
                                         }, <span style="color: #eab700;">GoAway</span>}),
    <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">send</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">GoAwayBin</span>),
    {next_state, closing, <span style="color: #eab700;">State</span>, 0}.
</pre>
</div>

<p>
It will actually send to go_away frame and then transition into the
`closing`, which might look like this.
</p>



<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">closing</span>(<span style="color: #eab700;">Message</span>, <span style="color: #eab700;">State</span>=#<span style="color: #4271ae;">connection_state</span>{
        socket={<span style="color: #eab700;">_</span>, undefined}
    }) -&gt;
    <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Does nothing if socket is undefined</span>
    {stop, normal, <span style="color: #eab700;">State</span>};
<span style="color: #f5871f;">closing</span>(<span style="color: #eab700;">Message</span>, <span style="color: #eab700;">State</span>=#<span style="color: #4271ae;">connection_state</span>{
        socket={<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">Socket</span>}
    }) -&gt;
    <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Closes the socket otherwise</span>
    <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">close</span>(<span style="color: #eab700;">Socket</span>),
    {stop, normal, <span style="color: #eab700;">State</span>}.
</pre>
</div>

<p>
We add another clause to cover if we don't have a socket set yet, so
it will do everything but close the socket.
</p>

<p>
So our go_away function effectively closes the connection with a
reason. We're going to use it if we have any problems establishing the
connection in the accept state.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">handshake</span>(timeout,
          <span style="color: #eab700;">StateWithSocket</span>=#<span style="color: #4271ae;">connection_state</span>{
            socket={<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">Socket</span>}
          }) -&gt;
</pre>
</div>

<p>
And now we have an FSM just sitting around with an open socket. Just
opening a socket's never been so easy! Now what?
</p>

<p>
We still need to start the connection. Fortunately for us, every
HTTP/2 connection begins with a preamble: "PRI *
HTTP/2.0\r\n\r\nSM\r\n\r\n". It's 24 characters of fried gold. Let's
ask for it immediately:
</p>

<div class="org-src-container">

<pre class="src src-erlang">{ok, &lt;&lt;<span style="color: #3e999f;">"PRI * HTTP/2.0\r\n\r\nSM\r\n\r\n"</span>&gt;&gt;}
    = <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">AcceptSocket</span>, 24, 5000),
{next_state, connected, <span style="color: #eab700;">StateWithSocket</span>, 0}.
</pre>
</div>

<p>
Those carets around the string means it's a binary! Let's go ahead and
store that accepted socket in the state and transition into the
connected state where we'll read frames.
</p>

<p>
but what if that doesn't come over? Well, this thing will explode,
which I guess is ok since we're never going to do our job as an HTTP/2
server anyway, but we don't have to be obnoxious about it.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #8959a8;">length</span>(?<span style="color: #4271ae;">PREAMBLE</span>), 5000) <span style="color: #718c00;">of</span>
    {ok, &lt;&lt;&lt;<span style="color: #3e999f;">"PRI * HTTP/2.0\r\n\r\nSM\r\n\r\n"</span>&gt;&gt;} -&gt;
        {next_state, connected, <span style="color: #eab700;">StateWithSocket</span>, 0};
    <span style="color: #eab700;">_</span> -&gt;
        <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateWithSocket</span>)
<span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
That'll stop the server from doing anything when we know we're done
and actually closes the socket tidily.
</p>

<p>
Now we're started up. We've received this, everything else will be a
HTTP/2 frame. Another thing we know from the RFC, is that a frame
header will always be nine bytes. So let's look at some code to pull a
frame off the wire:
</p>

<div class="org-src-container">

<pre class="src src-erlang">{ok, <span style="color: #eab700;">FrameHeaderBin</span>} = <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, 9),
<span style="color: #eab700;">FrameHeader</span> = <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read_binary_frame_header</span>(<span style="color: #eab700;">FrameHeaderBin</span>),
{ok, <span style="color: #eab700;">FramePayloadBin</span>} = <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">FrameHeader</span>#<span style="color: #4271ae;">frame_header</span>.length),
</pre>
</div>

<p>
We'll wrap it in something like
</p>
<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read</span>({<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">Socket</span>}, <span style="color: #eab700;">Timeout</span>).
</pre>
</div>

<p>
So you don't have to worry about it.
</p>

<p>
So what's the magic behind read_binary_frame_header?
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">read_binary_frame_header</span>(&lt;&lt;<span style="color: #eab700;">Length</span>:24,<span style="color: #eab700;">Type</span>:8,<span style="color: #eab700;">Flags</span>:8,<span style="color: #eab700;">_R</span>:1,<span style="color: #eab700;">StreamId</span>:31,<span style="color: #eab700;">_Rem</span>/bits&gt;&gt;) -&gt;
    #<span style="color: #4271ae;">frame_header</span>{
        length = <span style="color: #eab700;">Length</span>,
        type = <span style="color: #eab700;">Type</span>,
        flags = <span style="color: #eab700;">Flags</span>,
        stream_id = <span style="color: #eab700;">StreamId</span>
    }.
</pre>
</div>

<p>
Pattern matching is fun. See the carets around everything? This is a
binary. Notice those numbers! They're in bit counts not byte counts
because StreamId is 31 bits. My Sega Genesis was only 16 bits. The
`/bits` at the end is what makes this possible.
</p>

<p>
So great! We know the finite number of bytes to pull of wire to get a
frame. But this is a server, not a for loop. I mean, what's a for loop?
</p>

<p>
We basically need to write a `connected/2` callback for our gen_fsm to
handle a single frame on timeout.
</p>

<p>
The real fun is going to be in connected/2, because we're going to
read frames one at a time and process them.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">connected</span>(timeout, <span style="color: #eab700;">State</span>=#<span style="color: #4271ae;">connection_state</span>{
                            socket=<span style="color: #eab700;">Socket</span>
                        }) -&gt;
    {<span style="color: #eab700;">FrameHeader</span>, <span style="color: #eab700;">Payload</span>} = <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read</span>(<span style="color: #eab700;">Socket</span>),
    <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Do stuff, Maybe define "NewState" with an updated</span>
    <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">value for our remaining flow control credits maybe?</span>
    <span style="color: #4271ae;">route_frame</span>({<span style="color: #eab700;">FrameHeader</span>, <span style="color: #eab700;">Payload</span>}, <span style="color: #eab700;">State</span>).

<span style="color: #8959a8;">-spec</span> <span style="color: #4271ae;">route_frame</span>(<span style="color: #4271ae;">http2_frame</span>(), <span style="color: #4271ae;">connection_state</span>())
    -&gt;<span style="color: #f5871f;"> </span>{next_state,
        connected | continuation | closing,
        <span style="color: #4271ae;">connection_state</span>(),
        <span style="color: #8959a8;">non_neg_integer</span>()}.
<span style="color: #f5871f;">route_frame</span>(<span style="color: #eab700;">_</span>, <span style="color: #eab700;">State</span>) -&gt;
    {next_state, connected, <span style="color: #eab700;">State</span>, 0}.
</pre>
</div>

<p>
The function clause is "yet another pattern match" which is looking
for this function to have two arguments: a message `next` and a
bound variable `State`. By bound, I mean we can use `State` anywhere
in the function body and it will mean this thing that was passed
in. Also, you can't change it!
</p>

<p>
After the hashmark, we're saying this is a connection_state
record. That means that if anything that's not an connection_state
record is passed in here, it won't match this clause. Since that is
our only clause, this will blow up on a `badmatch` if any other
message comes in.
</p>

<p>
We could add a catch all like this tho:
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">connected</span>(<span style="color: #eab700;">AnyMessage</span>, <span style="color: #eab700;">AnythingButProbablyState</span>) -&gt;
    <span style="color: #4271ae;">io</span>:<span style="color: #4271ae;">format</span>(<span style="color: #3e999f;">"Unexpected message: ~p~n"</span>, [<span style="color: #eab700;">AnyMessage</span>]),
    <span style="color: #4271ae;">io</span>:<span style="color: #4271ae;">format</span>(<span style="color: #3e999f;">"Unexpected state: ~p~n"</span>, [<span style="color: #eab700;">AnythingButProbablyState</span>])
    {next_state, connected, <span style="color: #eab700;">AnythingButProbablyState</span>, 0}.
</pre>
</div>

<p>
io:format, it's like printf/puts/System.out.println for Erlang!
</p>

<p>
So this does nothing. Well, I refactored the frame reading code into
one function call, as you can imagine we're going to call it
alot. We'll "do stuff" later, but right now we need the skeleton of
the server in place, which is what this is. We're also going to have
it return the same return values that gen_fsm:StateName/2 would
return.
</p>
</div>
</div>
