draft.org
** Back to the Protocol

The rest should be as easy as routing these frames to different parts
of the process, right? Well, the RFC has its own ideas.

It's first idea is that there's to be a settings handshake at the
beginning of every connection. When you think about it, it makes a ton
of sense. Each side of the connection needs to know what the other
expects. It's the foundation of an healthy relationship!

The RFC also says that whenever you receive a SETTINGS frame... Oooh!
SETTINGS is one of the types of frames we talked about! Anyway, when
you get one, you have to acknowledge it, so your peer knew you got
it. So, to send an ACK, you send a SETTINGS frame back with the ACK
flag set in the frame header. OMG It's the final component of the
frame header: FLAGS!

So in the beginning, two pairs of SETTINGS frames are
exchanged. great. We could put this in the handshake callback, and it
would look like this:

#+BEGIN_SRC erlang
handshake(timeout,
          StateWithSocket=#connection_state{
            socket={Transport, Socket}
          }) ->
    case Transport:recv(Socket, length(?PREAMBLE), 5000) of
        {ok, <<<"PRI * HTTP/2.0\r\n\r\nSM\r\n\r\n">>} ->
            {next_state, connected, StateWithSocket, 0};
        _ ->
            go_away(?PROTOCOL_ERROR, StateWithSocket)
    end.
#+END_SRC

So, that's were we last left it. Let's add the settings handshake to
the accept state. All of this work is going to happen in this `case`
statement.

#+BEGIN_SRC erlang
case Transport:recv(Socket, length(?PREAMBLE), 5000) of
    {ok, <<?PREAMBLE>>} ->
        ServerSettings = #settings{} %% defaults!
        http2_frame_settings:send({Transport,Socket},
                                  #settings{}, ServerSettings),

        ClientSettingsFrame
          = {FH, _FPayload}
          = http2_frame:read({Transport,Socket}, 5000),

        {next_state, connected,
         StateWithSocket#connection_state{
             send_settings = ClientSettings,
             recv_settings = ServerSettings
         },0};
    BadPreamble ->
        go_away(?PROTOCOL_ERROR, StateWithSocket)
    end.
#+END_SRC

#+BEGIN_SRC erlang
http2_frame_settings:send(Socket, CurrentSettings, NewSettings),
Frame = {FH, _FPayload} = http2_frame:read({Transport,Socket}, 5000),
#+END_SRC


The way http2_frame handles this, is by reading the first 9 bytes and
pattern matching. We already saw this earlier. Once we've read those 9
bytes we know what type of frame it is, and how long it is, so we can
parse the rest of the frame:

First thing we'll do is define a callback in http2_frame like this:

#+BEGIN_SRC erlang
-callback read_binary(Bin::binary(),
                      Header::frame_header()) ->
    {ok, payload()} | {error, term()}.
#+END_SRC

We've got this "type" we've created called `payload` which can be the
parsed data from any of the ten frame types. We'll create a new module
for each type that implements this callback.

So let's walk through the process for reading the client settings

#+BEGIN_SRC erlang
read(Socket, Timeout) ->
    case read_header(Socket, Timeout) of
        {error, Reason} ->
            {error, Reason};
        FrameHeader ->
            {ok, Payload} = read_payload(Socket, FrameHeader, Timeout),
            {FrameHeader, Payload}
    end.
#+END_SRC

So read_header we've already seen. Actually, we saw the straight
binary version. Here's the TCP version.

#+BEGIN_SRC erlang
read_header({Transport, Socket}, Timeout) ->
    case Transport:recv(Socket, 9, Timeout) of
        {ok, HeaderBytes} ->
            {Header, <<>>} = read_binary_frame_header(HeaderBytes),
            Header;
        E -> E
    end.
#+END_SRC

This recv reads the next 9 bytes off the wire and then passes it to
the function we saw before with the binary pattern match.

But I'll show it to you again because I like you.

#+BEGIN_SRC erlang
read_binary_frame_header(<<Length:24,Type:8,Flags:8,_R:1,StreamId:31,Rem/bits>>) ->
    Header = #frame_header{
        length = Length,
        type = Type,
        flags = Flags,
        stream_id = StreamId
    },
    {Header, Rem}.
#+END_SRC

So, cool. This function is a little different. It's built so we can
read binaries of any size! So from a functional perspective, we're not
limited to reading bytes as we need them off a socket. This would be
more useful if we were using an active socket.

So, back to `read/2`:

#+BEGIN_SRC erlang
read(Socket, Timeout) ->
    case read_header(Socket, Timeout) of
        {error, Reason} ->
            {error, Reason};
        FrameHeader ->
            {ok, Payload} = read_payload(Socket, FrameHeader, Timeout),
            {FrameHeader, Payload}
    end.
#+END_SRC

Once we've got the frame header, we need to read the payload, and we
get to do some fun pattern matching again.

#+BEGIN_SRC erlang
read_payload(_, #frame_header{length=0}, _Timeout) ->
    {ok, FramePayload, <<>>} = read_binary_payload(<<>>, Header),
    {ok, FramePayload};
read_payload({Transport, Socket}, Header=#frame_header{length=L}, Timeout) ->
    case Transport:recv(Socket, L, Timeout) of
        {ok, DataBin} ->
            {ok, FramePayload, <<>>} = read_binary_payload(DataBin, Header),
            {ok, FramePayload};
        E -> E
    end.
#+END_SRC

read_payload pattern matches on length of the header. If it's 0 do
nothing, otherwise read those bytes off the socket, then send them off
to read_binary_payload. 0 actually means "read everything!" so we make
sure to skip the call to `recv`

#+BEGIN_SRC erlang
read_binary_payload(Bin, Header = #frame_header{type=?DATA}) ->
    http2_frame_data:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?HEADERS}) ->
    http2_frame_headers:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?PRIORITY}) ->
    http2_frame_priority:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?RST_STREAM}) ->
    http2_frame_rst_stream:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?SETTINGS}) ->
    http2_frame_settings:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?PUSH_PROMISE}) ->
    http2_frame_push_promise:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?PING}) ->
    http2_frame_ping:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?GOAWAY}) ->
    http2_frame_goaway:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?WINDOW_UPDATE}) ->
    http2_frame_window_update:read_binary(Bin, Header);
read_binary_payload(Bin, Header = #frame_header{type=?CONTINUATION}) ->
    http2_frame_continuation:read_binary(Bin, Header).
#+END_SRC

This one pattern matches on frame_type and calls the callback in the
appropriate module.

Our read_binary function in http2_frame_settings understands how to
turn this binary into a list of settings, and then how to overlay
those settings on top of the defaults. These steps are broken up
because an unset represents "no change" not "default value".

So, now out of the rabbit hole back to the accept state!

#+BEGIN_SRC erlang
case Transport:recv(Socket, length(?PREAMBLE), 5000) of
    {ok, <<?PREAMBLE>>} ->
        StateToRouteWith = send_settings(StateWithSocket),

        ClientSettingsFrame
          = {FH, ClientSettings}
          = http2_frame:read({Transport,Socket}, 5000),

        {next_state, connected,
         StateWithSocket#connection_state{
             send_settings = ClientSettings,
             recv_settings = ServerSettings
         },0};
    BadPreamble ->
        go_away(?PROTOCOL_ERROR, StateWithSocket)
end.
#+END_SRC

We've got the ClientSettings list. We need to overlay it on the spec's defaults:

#+BEGIN_SRC erlang
NewSendSettings
    = http2_frame_settings:overlay(#settings{},
                                   ClientSettings),
#+END_SRC

What's #settings{}?

#+BEGIN_SRC erlang
-record(settings, {header_table_size        = 4096,
                   enable_push              = 1,
                   max_concurrent_streams   = unlimited,
                   initial_window_size      = 65535,
                   max_frame_size           = 16384,
                   max_header_list_size     = unlimited}).
#+END_SRC

Those are the defaults from the spec.

Settings frames can come at any time and change the state of
the connection. Since this can happen more than once, we should have a
function for this.

Turns out, we already do. Remember `route_frame`? Well let's make it
do this job for us. Right now it just does nothing and returns the
state you pass in, but that's no way to live. This is the first of
many route_frame clauses.

#+BEGIN_SRC erlang
route_frame(_, State) -> {next_state, continuation, State}.
#+END_SRC

This is just the basic client settings receipt:

#+BEGIN_SRC erlang
route_frame({H, Payload}, S = #connection_state{
                                 socket=Socket,
                                 send_settings=SS
                                })
    when H#frame_header.type == ?SETTINGS,
         ?NOT_FLAG(H#frame_header.flags, ?FLAG_ACK) ->
#+END_SRC

`when` is a guard. It's kinda for when you can't use pattern matching
for some reason. I could have done the header type in a pattern match,
but the flags thing had to happen in a guard because it's more than
just a match. It's a bitwise and!

#+BEGIN_SRC erlang
-define(IS_FLAG(Flags, Flag), Flags band Flag =:= Flag).
-define(NOT_FLAG(Flags, Flag), Flags band Flag =/= Flag).
#+END_SRC

See what I did here? Each bit of `Flags` means something. ?FLAG_ACK is
a 1 in bit 0, which coincidentally, is also 1.

#+BEGIN_SRC erlang
    NewSendSettings = http2_frame_settings:overlay(SS, Payload),

    http2_frame_settings:ack(Socket),
    {next_state,
     connected,
     S#connection_state{
                        send_settings=NewSendSettings
     }};
#+END_SRC

There's more to be done here, as far as flow control goes. And we
haven't even gotten to frames yet, so let's move on.

Let's go use this route_frame function in `handshake/2`

#+BEGIN_SRC erlang
case Transport:recv(Socket, length(?PREAMBLE), 5000) of
    {ok, <<?PREAMBLE>>} ->
        StateToRouteWith = send_settings(StateWithSocket),

        Frame = {FH, _FPayload} = http2_frame:read({Transport,Socket}, 5000),

        try FH#frame_header.type of
            ?SETTINGS ->
                route_frame(Frame, StateToRouteWith);
            _ ->
                go_away(?PROTOCOL_ERROR, StateToRouteWith)
        catch
            _:_ ->
                go_away(?PROTOCOL_ERROR, StateToRouteWith)
        end;
    BadPreamble ->
        go_away(?PROTOCOL_ERROR, StateWithSocket)
end.
#+END_SRC

See that 5000 up there? It's saying that this should be an error case
if we don't get a frame in 5 seconds. We need to do a few more things
in here to make it work.

We have a way of timing out if we haven't received a clients settings
frame in 5 seconds. But what do we do about the ack of the server
settings?

The spec actually tells us something here:

#+BEGIN_SRC plaintext
6.5.3.  Settings Synchronization
If the sender of a SETTINGS frame does not receive an acknowledgement
within a reasonable amount of time, it MAY issue a connection error
(Section 5.4.1) of type SETTINGS_TIMEOUT.
#+END_SRC

An OPTIONAL requirement! How will we do it?

First of all, we're going to not apply our settings until we receive
the ACK. We just send them and use the spec's defaults for now. But
we're going to add a little more logic to the send.

#+BEGIN_SRC erlang
send_settings(State = #connection_state{
                         recv_settings=CurrentSettings,
                         socket=Socket,
                         settings_sent=SS
                        }) ->
    NewSettings = chatterbox:settings(),
    Ref = make_ref(),

    http2_frame_settings:send(Socket, CurrentSettings, NewSettings),
    send_ack_timeout({Ref,NewSettings}),
    State#connection_state{
      settings_sent=queue:in({Ref, NewSettings}, SS)
     }.
#+END_SRC

What we're doing here is saying "get our settings from our
application, and compare them to what's current (in this case, the
defaults). Then put those in a queue of settings we've sent to the
client, but haven't heard back about.

Fortunately we're not handicapped with what a "reasonable" amount of
time is. I'm going to choose 5s.

That's what `send_ack_timeout` is all about.

#+BEGIN_SRC erlang
send_ack_timeout(SS) ->
    Self = self(),
    SendAck = fun() ->
        timer:sleep(5000),
        gen_fsm:send_all_state_event(Self, {check_settings_ack,SS})
    end,
    spawn_link(SendAck).

#+END_SRC

We're creating a higher order function here. or a "lam ba da" as my
daughter calls them. It's a function that we can pass to another
function, and the function we're going to pass it to is a doozey!
spawn_link will spawn a whole new process that's linked to our
http2_connection. If anything blows up, it will tell us.

But if we put the call to `self()` inside our lambda, it'll be called
by the spawned function, and that will report it's own pid, so we'll
never get our message back.

All this function is doing is sleeping for 5s and then sending a
message back to our server about "Hey, have you heard back on this
yet?"

How do we know? Well, we know "This" is identified by "Ref", so let's
see if "Ref" is still first in the queue?

Also, what's `send_all_state_event`?

#+BEGIN_SRC erlang
handle_event({check_settings_ack, {Ref, NewSettings}},
             StateName,
             State=#connection_state{
                      settings_sent=SS
                     }) ->
    case queue:out(SS) of
        {{value, {Ref, NewSettings}}, _} ->
            %% This is still here!
            go_away(?SETTINGS_TIMEOUT, State);
        _ ->
            %% YAY!
            {next_state, StateName, State,0}
    end;
#+END_SRC

We don't care what state we were in. We process this message and then
go back into it. This means, no matter what, the alarm goes off and we
check that we got our ack.

Great! but when are the settings applied?  All we have to do is add an
ack clause to route_frame, which will get run every time we go through
the connected callback

#+BEGIN_SRC erlang
route_frame({H, _Payload},
            S = #connection_state{
                   settings_sent=SS
                  })
    when H#frame_header.type == ?SETTINGS,
         ?IS_FLAG(H#frame_header.flags, ?FLAG_ACK) ->
    lager:debug("Received SETTINGS ACK"),
    case queue:out(SS) of
        {{value, {_Ref, NewSettings}}, NewSS} ->
            {next_state,
             connected,
             S#connection_state{
               settings_sent=NewSS,
               recv_settings=NewSettings
              }};
        _ ->
            {next_state, closing, S, 0}
    end;
#+END_SRC

When an ACK comes over the wire, we pop the first settings we have on
the queue and use them. We apply them to the state and we're good!

Now, when our `{check_settings_ack...` message comes through, our
settings_sent will either be empty or have something with a different
ref on the front. Either way, we're set.

Then we need to use our new function to send our settings back in the
accept state.

#+BEGIN_SRC erlang
case Transport:recv(Socket, length(?PREAMBLE), 5000) of
    {ok, <<?PREAMBLE>>} ->
        StateToRouteWith = send_settings(StateWithSocket),

        Frame = {FH, _FPayload} = http2_frame:read({Transport,Socket}, 5000),

        try FH#frame_header.type of
            ?SETTINGS ->
                route_frame(Frame, StateToRouteWith);
            _ ->
                go_away(?PROTOCOL_ERROR, StateToRouteWith)
        catch
            _:_ ->
                go_away(?PROTOCOL_ERROR, StateToRouteWith)
        end;
    BadPreamble ->
        go_away(?PROTOCOL_ERROR, StateWithSocket)
end.

#+END_SRC

Look, we added some new logic to make it a little more robust while
we're here. Here's a try. It's awesome because it's like a Java
try/catch and a case statement all at once!

#+BEGIN_SRC erlang
try FH#frame_header.type of
    ?SETTINGS ->
        route_frame(Frame, StateToRouteWith);
    _ ->
        go_away(?PROTOCOL_ERROR, StateToRouteWith)
catch
    _:_ ->
        go_away(?SETTINGS_TIMEOUT, StateToRouteWith)
end;
#+END_SRC

If I tried to access FH#frame_header.type and FH was not a frame
header, what do you think would happen? Did you think "Literally
explode?" If you did, you'd be wrong. The explosion is figurative :D

Since sometimes FH can be the atom 'error', this is not uncommon. We
could check for error, but we can be more concise with the try.

Everything before the catch works just like a case statement with
pattern matching. Is FH#frame_header.type == ?SETTINGS? if so, route
it. Is it some other type of frame? Sorry, first frame has to be
SETTINGS, so GO_AWAY!

But if FH isn't a frame header at all, it's because http2:read_frame
returned `{error, timeout}`. The record access throws an error, and we
caught it with `_:_`!

In this case, we've violated the whole "reasonable time thing", so
we'll send a SETTINGS_TIMEOUT error instead of a PROTOCOL_ERROR,
although you could argue it is actually a PROTOCOL_ERROR. Any HTTP/2
heads that want to debate it later? let's do it!

