draft.html

<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31">Back to the Protocol</h3>
<div class="outline-text-3" id="text-orgheadline31">
<p>
The rest should be as easy as routing these frames to different parts
of the process, right? Well, the RFC has its own ideas.
</p>

<p>
It's first idea is that there's to be a settings handshake at the
beginning of every connection. When you think about it, it makes a ton
of sense. Each side of the connection needs to know what the other
expects. It's the foundation of an healthy relationship!
</p>

<p>
The RFC also says that whenever you receive a SETTINGS frame&#x2026; Oooh!
SETTINGS is one of the types of frames we talked about! Anyway, when
you get one, you have to acknowledge it, so your peer knew you got
it. So, to send an ACK, you send a SETTINGS frame back with the ACK
flag set in the frame header. OMG It's the final component of the
frame header: FLAGS!
</p>

<p>
So in the beginning, two pairs of SETTINGS frames are
exchanged. great. We could put this in the handshake callback, and it
would look like this:
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">handshake</span>(timeout,
          <span style="color: #eab700;">StateWithSocket</span>=#<span style="color: #4271ae;">connection_state</span>{
            socket={<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">Socket</span>}
          }) -&gt;
    <span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #8959a8;">length</span>(?<span style="color: #4271ae;">PREAMBLE</span>), 5000) <span style="color: #718c00;">of</span>
        {ok, &lt;&lt;&lt;<span style="color: #3e999f;">"PRI * HTTP/2.0\r\n\r\nSM\r\n\r\n"</span>&gt;&gt;} -&gt;
            {next_state, connected, <span style="color: #eab700;">StateWithSocket</span>, 0};
        <span style="color: #eab700;">_</span> -&gt;
            <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateWithSocket</span>)
    <span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
So, that's were we last left it. Let's add the settings handshake to
the accept state. All of this work is going to happen in this `case`
statement.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #8959a8;">length</span>(?<span style="color: #4271ae;">PREAMBLE</span>), 5000) <span style="color: #718c00;">of</span>
    {ok, &lt;&lt;?<span style="color: #4271ae;">PREAMBLE</span>&gt;&gt;} -&gt;
        <span style="color: #eab700;">ServerSettings</span> = #<span style="color: #4271ae;">settings</span>{} <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">defaults!</span>
        <span style="color: #4271ae;">http2_frame_settings</span>:<span style="color: #4271ae;">send</span>({<span style="color: #eab700;">Transport</span>,<span style="color: #eab700;">Socket</span>},
                                  #<span style="color: #4271ae;">settings</span>{}, <span style="color: #eab700;">ServerSettings</span>),

        <span style="color: #eab700;">ClientSettingsFrame</span>
          = {<span style="color: #eab700;">FH</span>, <span style="color: #eab700;">_FPayload</span>}
          = <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read</span>({<span style="color: #eab700;">Transport</span>,<span style="color: #eab700;">Socket</span>}, 5000),

        {next_state, connected,
         <span style="color: #eab700;">StateWithSocket</span>#<span style="color: #4271ae;">connection_state</span>{
             send_settings = <span style="color: #eab700;">ClientSettings</span>,
             recv_settings = <span style="color: #eab700;">ServerSettings</span>
         },0};
    <span style="color: #eab700;">BadPreamble</span> -&gt;
        <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateWithSocket</span>)
    <span style="color: #718c00;">end</span>.
</pre>
</div>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #4271ae;">http2_frame_settings</span>:<span style="color: #4271ae;">send</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">CurrentSettings</span>, <span style="color: #eab700;">NewSettings</span>),
<span style="color: #eab700;">Frame</span> = {<span style="color: #eab700;">FH</span>, <span style="color: #eab700;">_FPayload</span>} = <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read</span>({<span style="color: #eab700;">Transport</span>,<span style="color: #eab700;">Socket</span>}, 5000),
</pre>
</div>


<p>
The way http2_frame handles this, is by reading the first 9 bytes and
pattern matching. We already saw this earlier. Once we've read those 9
bytes we know what type of frame it is, and how long it is, so we can
parse the rest of the frame:
</p>

<p>
First thing we'll do is define a callback in http2_frame like this:
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #8959a8;">-callback</span> <span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>::<span style="color: #4271ae;">binary</span>(),
                      <span style="color: #eab700;">Header</span>::<span style="color: #4271ae;">frame_header</span>()) -&gt;
    {ok, <span style="color: #4271ae;">payload</span>()} | {error, <span style="color: #8959a8;">term</span>()}.
</pre>
</div>

<p>
We've got this "type" we've created called `payload` which can be the
parsed data from any of the ten frame types. We'll create a new module
for each type that implements this callback.
</p>

<p>
So let's walk through the process for reading the client settings
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">read</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">Timeout</span>) -&gt;
    <span style="color: #718c00;">case</span> <span style="color: #4271ae;">read_header</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">Timeout</span>) <span style="color: #718c00;">of</span>
        {error, <span style="color: #eab700;">Reason</span>} -&gt;
            {error, <span style="color: #eab700;">Reason</span>};
        <span style="color: #eab700;">FrameHeader</span> -&gt;
            {ok, <span style="color: #eab700;">Payload</span>} = <span style="color: #4271ae;">read_payload</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">FrameHeader</span>, <span style="color: #eab700;">Timeout</span>),
            {<span style="color: #eab700;">FrameHeader</span>, <span style="color: #eab700;">Payload</span>}
    <span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
So read_header we've already seen. Actually, we saw the straight
binary version. Here's the TCP version.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">read_header</span>({<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">Socket</span>}, <span style="color: #eab700;">Timeout</span>) -&gt;
    <span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, 9, <span style="color: #eab700;">Timeout</span>) <span style="color: #718c00;">of</span>
        {ok, <span style="color: #eab700;">HeaderBytes</span>} -&gt;
            {<span style="color: #eab700;">Header</span>, &lt;&lt;&gt;&gt;} = <span style="color: #4271ae;">read_binary_frame_header</span>(<span style="color: #eab700;">HeaderBytes</span>),
            <span style="color: #eab700;">Header</span>;
        <span style="color: #eab700;">E</span> -&gt;<span style="color: #f5871f;"> </span><span style="color: #eab700;">E</span>
    <span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
This recv reads the next 9 bytes off the wire and then passes it to
the function we saw before with the binary pattern match.
</p>

<p>
But I'll show it to you again because I like you.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">read_binary_frame_header</span>(&lt;&lt;<span style="color: #eab700;">Length</span>:24,<span style="color: #eab700;">Type</span>:8,<span style="color: #eab700;">Flags</span>:8,<span style="color: #eab700;">_R</span>:1,<span style="color: #eab700;">StreamId</span>:31,<span style="color: #eab700;">Rem</span>/bits&gt;&gt;) -&gt;
    <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{
        length = <span style="color: #eab700;">Length</span>,
        type = <span style="color: #eab700;">Type</span>,
        flags = <span style="color: #eab700;">Flags</span>,
        stream_id = <span style="color: #eab700;">StreamId</span>
    },
    {<span style="color: #eab700;">Header</span>, <span style="color: #eab700;">Rem</span>}.
</pre>
</div>

<p>
So, cool. This function is a little different. It's built so we can
read binaries of any size! So from a functional perspective, we're not
limited to reading bytes as we need them off a socket. This would be
more useful if we were using an active socket.
</p>

<p>
So, back to `read/2`:
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">read</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">Timeout</span>) -&gt;
    <span style="color: #718c00;">case</span> <span style="color: #4271ae;">read_header</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">Timeout</span>) <span style="color: #718c00;">of</span>
        {error, <span style="color: #eab700;">Reason</span>} -&gt;
            {error, <span style="color: #eab700;">Reason</span>};
        <span style="color: #eab700;">FrameHeader</span> -&gt;
            {ok, <span style="color: #eab700;">Payload</span>} = <span style="color: #4271ae;">read_payload</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">FrameHeader</span>, <span style="color: #eab700;">Timeout</span>),
            {<span style="color: #eab700;">FrameHeader</span>, <span style="color: #eab700;">Payload</span>}
    <span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
Once we've got the frame header, we need to read the payload, and we
get to do some fun pattern matching again.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">read_payload</span>(<span style="color: #eab700;">_</span>, #<span style="color: #4271ae;">frame_header</span>{length=0}, <span style="color: #eab700;">_Timeout</span>) -&gt;
    {ok, <span style="color: #eab700;">FramePayload</span>, &lt;&lt;&gt;&gt;} = <span style="color: #4271ae;">read_binary_payload</span>(&lt;&lt;&gt;&gt;, <span style="color: #eab700;">Header</span>),
    {ok, <span style="color: #eab700;">FramePayload</span>};
<span style="color: #f5871f;">read_payload</span>({<span style="color: #eab700;">Transport</span>, <span style="color: #eab700;">Socket</span>}, <span style="color: #eab700;">Header</span>=#<span style="color: #4271ae;">frame_header</span>{length=<span style="color: #eab700;">L</span>}, <span style="color: #eab700;">Timeout</span>) -&gt;
    <span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">L</span>, <span style="color: #eab700;">Timeout</span>) <span style="color: #718c00;">of</span>
        {ok, <span style="color: #eab700;">DataBin</span>} -&gt;
            {ok, <span style="color: #eab700;">FramePayload</span>, &lt;&lt;&gt;&gt;} = <span style="color: #4271ae;">read_binary_payload</span>(<span style="color: #eab700;">DataBin</span>, <span style="color: #eab700;">Header</span>),
            {ok, <span style="color: #eab700;">FramePayload</span>};
        <span style="color: #eab700;">E</span> -&gt;<span style="color: #f5871f;"> </span><span style="color: #eab700;">E</span>
    <span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
read_payload pattern matches on length of the header. If it's 0 do
nothing, otherwise read those bytes off the socket, then send them off
to read_binary_payload. 0 actually means "read everything!" so we make
sure to skip the call to `recv`
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">DATA</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_data</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">HEADERS</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_headers</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">PRIORITY</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_priority</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">RST_STREAM</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_rst_stream</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">SETTINGS</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_settings</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">PUSH_PROMISE</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_push_promise</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">PING</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_ping</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">GOAWAY</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_goaway</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">WINDOW_UPDATE</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_window_update</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>);
<span style="color: #f5871f;">read_binary_payload</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span> = #<span style="color: #4271ae;">frame_header</span>{type=?<span style="color: #4271ae;">CONTINUATION</span>}) -&gt;
    <span style="color: #4271ae;">http2_frame_continuation</span>:<span style="color: #4271ae;">read_binary</span>(<span style="color: #eab700;">Bin</span>, <span style="color: #eab700;">Header</span>).
</pre>
</div>

<p>
This one pattern matches on frame_type and calls the callback in the
appropriate module.
</p>

<p>
Our read_binary function in http2_frame_settings understands how to
turn this binary into a list of settings, and then how to overlay
those settings on top of the defaults. These steps are broken up
because an unset represents "no change" not "default value".
</p>

<p>
So, now out of the rabbit hole back to the accept state!
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #8959a8;">length</span>(?<span style="color: #4271ae;">PREAMBLE</span>), 5000) <span style="color: #718c00;">of</span>
    {ok, &lt;&lt;?<span style="color: #4271ae;">PREAMBLE</span>&gt;&gt;} -&gt;
        <span style="color: #eab700;">StateToRouteWith</span> = <span style="color: #4271ae;">send_settings</span>(<span style="color: #eab700;">StateWithSocket</span>),

        <span style="color: #eab700;">ClientSettingsFrame</span>
          = {<span style="color: #eab700;">FH</span>, <span style="color: #eab700;">ClientSettings</span>}
          = <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read</span>({<span style="color: #eab700;">Transport</span>,<span style="color: #eab700;">Socket</span>}, 5000),

        {next_state, connected,
         <span style="color: #eab700;">StateWithSocket</span>#<span style="color: #4271ae;">connection_state</span>{
             send_settings = <span style="color: #eab700;">ClientSettings</span>,
             recv_settings = <span style="color: #eab700;">ServerSettings</span>
         },0};
    <span style="color: #eab700;">BadPreamble</span> -&gt;
        <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateWithSocket</span>)
<span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
We've got the ClientSettings list. We need to overlay it on the spec's defaults:
</p>

<div class="org-src-container">

<pre class="src src-erlang">NewSendSettings
    = <span style="color: #4271ae;">http2_frame_settings</span>:<span style="color: #4271ae;">overlay</span>(#<span style="color: #4271ae;">settings</span>{},
                                   <span style="color: #eab700;">ClientSettings</span>),
</pre>
</div>

<p>
What's #settings{}?
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #8959a8;">-record</span>(<span style="color: #4271ae;">settings</span>, {header_table_size        = 4096,
                   enable_push              = 1,
                   max_concurrent_streams   = unlimited,
                   initial_window_size      = 65535,
                   max_frame_size           = 16384,
                   max_header_list_size     = unlimited}).
</pre>
</div>

<p>
Those are the defaults from the spec.
</p>

<p>
Settings frames can come at any time and change the state of
the connection. Since this can happen more than once, we should have a
function for this.
</p>

<p>
Turns out, we already do. Remember `route_frame`? Well let's make it
do this job for us. Right now it just does nothing and returns the
state you pass in, but that's no way to live. This is the first of
many route_frame clauses.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">route_frame</span>(<span style="color: #eab700;">_</span>, <span style="color: #eab700;">State</span>) -&gt;<span style="color: #f5871f;"> </span>{next_state, continuation, <span style="color: #eab700;">State</span>}.
</pre>
</div>

<p>
This is just the basic client settings receipt:
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">route_frame</span>({<span style="color: #eab700;">H</span>, <span style="color: #eab700;">Payload</span>}, <span style="color: #eab700;">S</span> = #<span style="color: #4271ae;">connection_state</span>{
                                 socket=<span style="color: #eab700;">Socket</span>,
                                 send_settings=<span style="color: #eab700;">SS</span>
                                })
    <span style="color: #718c00;">when</span> <span style="color: #eab700;">H</span>#<span style="color: #4271ae;">frame_header</span>.type == ?<span style="color: #4271ae;">SETTINGS</span>,
         ?<span style="color: #4271ae;">NOT_FLAG</span>(<span style="color: #eab700;">H</span>#<span style="color: #4271ae;">frame_header</span>.flags, ?<span style="color: #4271ae;">FLAG_ACK</span>) -&gt;
</pre>
</div>

<p>
`when` is a guard. It's kinda for when you can't use pattern matching
for some reason. I could have done the header type in a pattern match,
but the flags thing had to happen in a guard because it's more than
just a match. It's a bitwise and!
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #8959a8;">-define</span>(<span style="color: #eab700;">IS_FLAG</span>(<span style="color: #eab700;">Flags</span>, <span style="color: #eab700;">Flag</span>), <span style="color: #eab700;">Flags</span> <span style="color: #8959a8;">band</span> <span style="color: #eab700;">Flag</span> =:= <span style="color: #eab700;">Flag</span>).
<span style="color: #8959a8;">-define</span>(<span style="color: #eab700;">NOT_FLAG</span>(<span style="color: #eab700;">Flags</span>, <span style="color: #eab700;">Flag</span>), <span style="color: #eab700;">Flags</span> <span style="color: #8959a8;">band</span> <span style="color: #eab700;">Flag</span> =/= <span style="color: #eab700;">Flag</span>).
</pre>
</div>

<p>
See what I did here? Each bit of `Flags` means something. ?FLAG_ACK is
a 1 in bit 0, which coincidentally, is also 1.
</p>

<div class="org-src-container">

<pre class="src src-erlang">NewSendSettings = <span style="color: #4271ae;">http2_frame_settings</span>:<span style="color: #4271ae;">overlay</span>(<span style="color: #eab700;">SS</span>, <span style="color: #eab700;">Payload</span>),

<span style="color: #4271ae;">http2_frame_settings</span>:<span style="color: #4271ae;">ack</span>(<span style="color: #eab700;">Socket</span>),
{next_state,
 connected,
 <span style="color: #eab700;">S</span>#<span style="color: #4271ae;">connection_state</span>{
                    send_settings=<span style="color: #eab700;">NewSendSettings</span>
 }};
</pre>
</div>

<p>
There's more to be done here, as far as flow control goes. And we
haven't even gotten to frames yet, so let's move on.
</p>

<p>
Let's go use this route_frame function in `handshake/2`
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #8959a8;">length</span>(?<span style="color: #4271ae;">PREAMBLE</span>), 5000) <span style="color: #718c00;">of</span>
    {ok, &lt;&lt;?<span style="color: #4271ae;">PREAMBLE</span>&gt;&gt;} -&gt;
        <span style="color: #eab700;">StateToRouteWith</span> = <span style="color: #4271ae;">send_settings</span>(<span style="color: #eab700;">StateWithSocket</span>),

        <span style="color: #eab700;">Frame</span> = {<span style="color: #eab700;">FH</span>, <span style="color: #eab700;">_FPayload</span>} = <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read</span>({<span style="color: #eab700;">Transport</span>,<span style="color: #eab700;">Socket</span>}, 5000),

        <span style="color: #718c00;">try</span> <span style="color: #eab700;">FH</span>#<span style="color: #4271ae;">frame_header</span>.type <span style="color: #718c00;">of</span>
            ?<span style="color: #4271ae;">SETTINGS</span> -&gt;
                <span style="color: #4271ae;">route_frame</span>(<span style="color: #eab700;">Frame</span>, <span style="color: #eab700;">StateToRouteWith</span>);
            <span style="color: #eab700;">_</span> -&gt;
                <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateToRouteWith</span>)
        <span style="color: #718c00;">catch</span>
            <span style="color: #eab700;">_</span>:<span style="color: #eab700;">_</span> -&gt;
                <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateToRouteWith</span>)
        <span style="color: #718c00;">end</span>;
    <span style="color: #eab700;">BadPreamble</span> -&gt;
        <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateWithSocket</span>)
<span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
See that 5000 up there? It's saying that this should be an error case
if we don't get a frame in 5 seconds. We need to do a few more things
in here to make it work.
</p>

<p>
We have a way of timing out if we haven't received a clients settings
frame in 5 seconds. But what do we do about the ack of the server
settings?
</p>

<p>
The spec actually tells us something here:
</p>

<div class="org-src-container">

<pre class="src src-plaintext">6.5.3.  Settings Synchronization
If the sender of a SETTINGS frame does not receive an acknowledgement
within a reasonable amount of time, it MAY issue a connection error
(Section 5.4.1) of type SETTINGS_TIMEOUT.
</pre>
</div>

<p>
An OPTIONAL requirement! How will we do it?
</p>

<p>
First of all, we're going to not apply our settings until we receive
the ACK. We just send them and use the spec's defaults for now. But
we're going to add a little more logic to the send.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">send_settings</span>(<span style="color: #eab700;">State</span> = #<span style="color: #4271ae;">connection_state</span>{
                         recv_settings=<span style="color: #eab700;">CurrentSettings</span>,
                         socket=<span style="color: #eab700;">Socket</span>,
                         settings_sent=<span style="color: #eab700;">SS</span>
                        }) -&gt;
    <span style="color: #eab700;">NewSettings</span> = <span style="color: #4271ae;">chatterbox</span>:<span style="color: #4271ae;">settings</span>(),
    <span style="color: #eab700;">Ref</span> = <span style="color: #8959a8;">make_ref</span>(),

    <span style="color: #4271ae;">http2_frame_settings</span>:<span style="color: #4271ae;">send</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #eab700;">CurrentSettings</span>, <span style="color: #eab700;">NewSettings</span>),
    <span style="color: #4271ae;">send_ack_timeout</span>({<span style="color: #eab700;">Ref</span>,<span style="color: #eab700;">NewSettings</span>}),
    <span style="color: #eab700;">State</span>#<span style="color: #4271ae;">connection_state</span>{
      settings_sent=<span style="color: #4271ae;">queue</span>:<span style="color: #4271ae;">in</span>({<span style="color: #eab700;">Ref</span>, <span style="color: #eab700;">NewSettings</span>}, <span style="color: #eab700;">SS</span>)
     }.
</pre>
</div>

<p>
What we're doing here is saying "get our settings from our
application, and compare them to what's current (in this case, the
defaults). Then put those in a queue of settings we've sent to the
client, but haven't heard back about.
</p>

<p>
Fortunately we're not handicapped with what a "reasonable" amount of
time is. I'm going to choose 5s.
</p>

<p>
That's what `send_ack_timeout` is all about.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">send_ack_timeout</span>(<span style="color: #eab700;">SS</span>) -&gt;
    <span style="color: #eab700;">Self</span> = <span style="color: #8959a8;">self</span>(),
    <span style="color: #eab700;">SendAck</span> = <span style="color: #718c00;">fun</span>() -&gt;
        <span style="color: #4271ae;">timer</span>:<span style="color: #4271ae;">sleep</span>(5000),
        <span style="color: #4271ae;">gen_fsm</span>:<span style="color: #4271ae;">send_all_state_event</span>(<span style="color: #eab700;">Self</span>, {check_settings_ack,<span style="color: #eab700;">SS</span>})
    <span style="color: #718c00;">end</span>,
    <span style="color: #8959a8;">spawn_link</span>(<span style="color: #eab700;">SendAck</span>).
</pre>
</div>

<p>
We're creating a higher order function here. or a "lam ba da" as my
daughter calls them. It's a function that we can pass to another
function, and the function we're going to pass it to is a doozey!
spawn_link will spawn a whole new process that's linked to our
http2_connection. If anything blows up, it will tell us.
</p>

<p>
But if we put the call to `self()` inside our lambda, it'll be called
by the spawned function, and that will report it's own pid, so we'll
never get our message back.
</p>

<p>
All this function is doing is sleeping for 5s and then sending a
message back to our server about "Hey, have you heard back on this
yet?"
</p>

<p>
How do we know? Well, we know "This" is identified by "Ref", so let's
see if "Ref" is still first in the queue?
</p>

<p>
Also, what's `send_all_state_event`?
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">handle_event</span>({check_settings_ack, {<span style="color: #eab700;">Ref</span>, <span style="color: #eab700;">NewSettings</span>}},
             <span style="color: #eab700;">StateName</span>,
             <span style="color: #eab700;">State</span>=#<span style="color: #4271ae;">connection_state</span>{
                      settings_sent=<span style="color: #eab700;">SS</span>
                     }) -&gt;
    <span style="color: #718c00;">case</span> <span style="color: #4271ae;">queue</span>:<span style="color: #4271ae;">out</span>(<span style="color: #eab700;">SS</span>) <span style="color: #718c00;">of</span>
        {{value, {<span style="color: #eab700;">Ref</span>, <span style="color: #eab700;">NewSettings</span>}}, <span style="color: #eab700;">_</span>} -&gt;
            <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">This is still here!</span>
            <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">SETTINGS_TIMEOUT</span>, <span style="color: #eab700;">State</span>);
        <span style="color: #eab700;">_</span> -&gt;
            <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">YAY!</span>
            {next_state, <span style="color: #eab700;">StateName</span>, <span style="color: #eab700;">State</span>,0}
    <span style="color: #718c00;">end</span>;
</pre>
</div>

<p>
We don't care what state we were in. We process this message and then
go back into it. This means, no matter what, the alarm goes off and we
check that we got our ack.
</p>

<p>
Great! but when are the settings applied?  All we have to do is add an
ack clause to route_frame, which will get run every time we go through
the connected callback
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">route_frame</span>({<span style="color: #eab700;">H</span>, <span style="color: #eab700;">_Payload</span>},
            <span style="color: #eab700;">S</span> = #<span style="color: #4271ae;">connection_state</span>{
                   settings_sent=<span style="color: #eab700;">SS</span>
                  })
    <span style="color: #718c00;">when</span> <span style="color: #eab700;">H</span>#<span style="color: #4271ae;">frame_header</span>.type == ?<span style="color: #4271ae;">SETTINGS</span>,
         ?<span style="color: #4271ae;">IS_FLAG</span>(<span style="color: #eab700;">H</span>#<span style="color: #4271ae;">frame_header</span>.flags, ?<span style="color: #4271ae;">FLAG_ACK</span>) -&gt;
    <span style="color: #4271ae;">lager</span>:<span style="color: #4271ae;">debug</span>(<span style="color: #3e999f;">"Received SETTINGS ACK"</span>),
    <span style="color: #718c00;">case</span> <span style="color: #4271ae;">queue</span>:<span style="color: #4271ae;">out</span>(<span style="color: #eab700;">SS</span>) <span style="color: #718c00;">of</span>
        {{value, {<span style="color: #eab700;">_Ref</span>, <span style="color: #eab700;">NewSettings</span>}}, <span style="color: #eab700;">NewSS</span>} -&gt;
            {next_state,
             connected,
             <span style="color: #eab700;">S</span>#<span style="color: #4271ae;">connection_state</span>{
               settings_sent=<span style="color: #eab700;">NewSS</span>,
               recv_settings=<span style="color: #eab700;">NewSettings</span>
              }};
        <span style="color: #eab700;">_</span> -&gt;
            {next_state, closing, <span style="color: #eab700;">S</span>, 0}
    <span style="color: #718c00;">end</span>;
</pre>
</div>

<p>
When an ACK comes over the wire, we pop the first settings we have on
the queue and use them. We apply them to the state and we're good!
</p>

<p>
Now, when our `{check_settings_ack&#x2026;` message comes through, our
settings_sent will either be empty or have something with a different
ref on the front. Either way, we're set.
</p>

<p>
Then we need to use our new function to send our settings back in the
accept state.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #718c00;">case</span> <span style="color: #eab700;">Transport</span>:<span style="color: #4271ae;">recv</span>(<span style="color: #eab700;">Socket</span>, <span style="color: #8959a8;">length</span>(?<span style="color: #4271ae;">PREAMBLE</span>), 5000) <span style="color: #718c00;">of</span>
    {ok, &lt;&lt;?<span style="color: #4271ae;">PREAMBLE</span>&gt;&gt;} -&gt;
        <span style="color: #eab700;">StateToRouteWith</span> = <span style="color: #4271ae;">send_settings</span>(<span style="color: #eab700;">StateWithSocket</span>),

        <span style="color: #eab700;">Frame</span> = {<span style="color: #eab700;">FH</span>, <span style="color: #eab700;">_FPayload</span>} = <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read</span>({<span style="color: #eab700;">Transport</span>,<span style="color: #eab700;">Socket</span>}, 5000),

        <span style="color: #718c00;">try</span> <span style="color: #eab700;">FH</span>#<span style="color: #4271ae;">frame_header</span>.type <span style="color: #718c00;">of</span>
            ?<span style="color: #4271ae;">SETTINGS</span> -&gt;
                <span style="color: #4271ae;">route_frame</span>(<span style="color: #eab700;">Frame</span>, <span style="color: #eab700;">StateToRouteWith</span>);
            <span style="color: #eab700;">_</span> -&gt;
                <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateToRouteWith</span>)
        <span style="color: #718c00;">catch</span>
            <span style="color: #eab700;">_</span>:<span style="color: #eab700;">_</span> -&gt;
                <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateToRouteWith</span>)
        <span style="color: #718c00;">end</span>;
    <span style="color: #eab700;">BadPreamble</span> -&gt;
        <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateWithSocket</span>)
<span style="color: #718c00;">end</span>.
</pre>
</div>

<p>
Look, we added some new logic to make it a little more robust while
we're here. Here's a try. It's awesome because it's like a Java
try/catch and a case statement all at once!
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #718c00;">try</span> <span style="color: #eab700;">FH</span>#<span style="color: #4271ae;">frame_header</span>.type <span style="color: #718c00;">of</span>
    ?<span style="color: #4271ae;">SETTINGS</span> -&gt;
        <span style="color: #4271ae;">route_frame</span>(<span style="color: #eab700;">Frame</span>, <span style="color: #eab700;">StateToRouteWith</span>);
    <span style="color: #eab700;">_</span> -&gt;
        <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">StateToRouteWith</span>)
<span style="color: #718c00;">catch</span>
    <span style="color: #eab700;">_</span>:<span style="color: #eab700;">_</span> -&gt;
        <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">SETTINGS_TIMEOUT</span>, <span style="color: #eab700;">StateToRouteWith</span>)
<span style="color: #718c00;">end</span>;
</pre>
</div>

<p>
If I tried to access FH#frame_header.type and FH was not a frame
header, what do you think would happen? Did you think "Literally
explode?" If you did, you'd be wrong. The explosion is figurative :D
</p>

<p>
Since sometimes FH can be the atom 'error', this is not uncommon. We
could check for error, but we can be more concise with the try.
</p>

<p>
Everything before the catch works just like a case statement with
pattern matching. Is FH#frame_header.type == ?SETTINGS? if so, route
it. Is it some other type of frame? Sorry, first frame has to be
SETTINGS, so GO_AWAY!
</p>

<p>
But if FH isn't a frame header at all, it's because http2:read_frame
returned `{error, timeout}`. The record access throws an error, and we
caught it with `_:_`!
</p>

<p>
In this case, we've violated the whole "reasonable time thing", so
we'll send a SETTINGS_TIMEOUT error instead of a PROTOCOL_ERROR,
although you could argue it is actually a PROTOCOL_ERROR. Any HTTP/2
heads that want to debate it later? let's do it!
</p>
</div>
</div>
