draft.org
** The Connection is open, long live the connection!

At this point we have an open connection and we're just chillin'
waiting for frames. More often than not, as a server, the first frame
we get is going to be on a new stream id, and it's going to be a
HEADERS frame.

NOT TO BE CONFUSED WITH A FRAME HEADER. Because boy, it can get
confusing.

A new stream id and a HEADERS frame means this is a HTTP request. Yay,
we're about to serve up some justice! Um... I mean content.

There are a couple of issues we have to handle here. First of all
there's this idea of CONTINUATION frames. Here's the deal. HPACK is
encoding the headers it sent to us, so these headers are a binary
encoded hunk of data. If that binary hunk is bigger than
MAX_FRAME_SIZE, it needs to come over in multiple frames. Those frames
are of type "CONTINUATION". No big deal right? This is the race
condition with HPACK I alluded to before.

Well, because HPACK is always indexing things for later use and
streams are multiplexed, it's really important that they're processed
in order. What that means to us at the implementation level is that
once we get a HEADERS frame on a stream, the connection is in lockdown
and can only receive CONTINUATION frames on that stream id until the
complete set of headers has been sent. This is effectively a mutex to
solve this.

How do we know when that's happened? Both HEADERS and CONTINUATION
frames have an END_HEADERS flag that can be set in the frame header,
so we look for that.

Back in our connected state, we're just routing frames, but not
really paying attention to state. We could have enhanced it to deal
with the server's state record, and then added some fields to the
state record to decide if the connection is in HEADER lockdown, but
there's a better way!

** connected state

The connected state is basically a place where we've got an open
connection and we're ready to accept frames.

