draft.org
** continuation state

Ok, so great, we're finally able to compensate for this HPACK mutex
business. Let me sum up the conditional logic again:

When a HEADERS frame comes in on stream N, the only frames that can be
accepted by the server are CONTINUATION frames on stream N until the
END_HEADERS flag is received.

Good news is, there's a trivial case: When the HEADERS frame also has
the END_HEADERS flag! That totally can happen. It all depends on frame
size limits and number of headers.

Here's what that route_frame looks like

#+BEGIN_SRC erlang
route_frame(F={H=#frame_header{
                  type=?HEADERS,
                  stream_id=StreamId
                 }, _Payload} = Frame,
        S = #connection_state{
               decode_context=DecodeContext,
               recv_settings=#settings{initial_window_size=RecvWindowSize},
               send_settings=#settings{initial_window_size=SendWindowSize},
               streams=_Streams,
               content_handler = Handler
           })
#+END_SRC

All we're doing here is figuring out with pattern matching "what bits
of state we'll need for this frame" and then we have a guard to check
"Did it have headers? Did it have the flag? Then it wasn't us"

I'm dropping a bunch more stuff on you here because I won't have time
to make a deeper dive on streams later. The connection keeps track of
all the open streams, what their state is, and flow control
information. Go read the code to learn more. Maybe talk tonight?


#+BEGIN_SRC erlang
    Stream = http2_stream:new(StreamId, {SendWindowSize, RecvWindowSize}),
    {NewStream1, NewConnectionState} = http2_stream:recv_frame(Frame, {NewStream, S}),
#+END_SRC

Look, http2_stream:recv_frame is like a stream level version of
route_frame. It helps us manage the state of each stream from this
diagram.

#+BEGIN_SRC plaintext
                                +--------+
                        send PP |        | recv PP
                       ,--------|  idle  |--------.
                      /         |        |         \
                     v          +--------+          v
              +----------+          |           +----------+
              |          |          | send H /  |          |
       ,------| reserved |          | recv H    | reserved |------.
       |      | (local)  |          |           | (remote) |      |
       |      +----------+          v           +----------+      |
       |          |             +--------+             |          |
       |          |     recv ES |        | send ES     |          |
       |   send H |     ,-------|  open  |-------.     | recv H   |
       |          |    /        |        |        \    |          |
       |          v   v         +--------+         v   v          |
       |      +----------+          |           +----------+      |
       |      |   half   |          |           |   half   |      |
       |      |  closed  |          | send R /  |  closed  |      |
       |      | (remote) |          | recv R    | (local)  |      |
       |      +----------+          |           +----------+      |
       |           |                |                 |           |
       |           | send ES /      |       recv ES / |           |
       |           | send R /       v        send R / |           |
       |           | recv R     +--------+   recv R   |           |
       | send R /  `----------->|        |<-----------'  send R / |
       | recv R                 | closed |               recv R   |
       `----------------------->|        |<----------------------'
                                +--------+
#+END_SRC

Let's dive in there for a minute, because otherwise we'd just have to
talk about error_handling

For the trivial case where a single headers frame comes in and it's
both the END of the header block AND the request, it looks pretty simple:

#+BEGIN_SRC erlang
recv_frame(F={#frame_header{
                   flags=Flags,
                   type=?HEADERS
                  }, _Payload},
           {Stream=#stream_state{
                      state=idle
                     },
            Connection=#connection_state{
              decode_context=DecodeContext,
              content_handler=Handler
             }})
  when ?IS_FLAG(Flags, ?FLAG_END_STREAM),
       ?IS_FLAG(Flags, ?FLAG_END_HEADERS) ->
    HeadersBin = http2_frame_headers:from_frames([F]),
    {Headers, NewDecodeContext} = hpack:decode(HeadersBin, DecodeContext),
    Handler:spawn_handle(self(), StreamId, Headers, <<>>),
    {Stream#stream_state{request_headers=Headers},
     Connection#connection_state{
       decode_context=NewDecodeContext
      }
     };
#+END_SRC

There are a lot more clauses, but we won't have time to talk about
them right now. Don't be sad, I'm here all week!

We're doing two things in here, and really, those things just get
split up into different squares on that diagram.

First is decoding the headers.

Headers can be a list of frames, but in this case it's only one. It's
easier for us if it's a list of one, so we wrapped the frame in a
`[]`. Then we want to decode the binary. See how it takes in a Context
and returns a new one? That is the index that changes.

Second is handling the request.

This is just the content handler. In our case we're serving up files
as DATA frames, but we could and probably will write a webmachine
handler that could be used here as well.

Since we know this is an END_HEADERS, we don't even need to transition
into the continuation state. We don't need the mutex since we've
already met the target condition! We'll go set the NextState value
back at the connection level

#+BEGIN_SRC erlang
    NextState = case ?IS_FLAG(H#frame_header.flags, ?FLAG_END_HEADERS) of
                    true ->
                        connected;
                    false ->
                        continuation
                end,
    {next_state, NextState, NewConnectionState#connection_state{
                                 streams = [{StreamId, NewStream1}|Streams],
                                 continuation_stream_id = StreamId
                                }, 0}
#+END_SRC

Since this was a new stream, we can just add it to the list. If it
weren't we'd have to remove the old one first so there could be only
one. Then we transition straight back to connected.

So, we make a new stream and throw it in the state. In the case where
we don't have an END HEADERS flag in our frame header (not a header
frame... uggggg), then we transition to the continuation state. That's
it. It's off to Mutexburg, population: you!

#+BEGIN_SRC erlang
continuation(next,
             S = #connection_state{
                    socket=Socket,
                    continuation_stream_id = StreamId
                   }) ->
    Response =
        case http2_frame:read(Socket, 10) of
            {error, _} ->
                {next_state, continuation, S, 0};
            Frame = {#frame_header{
                     stream_id=StreamId,
                     type=?CONTINUATION
                    }, _} ->
                route_frame(Frame, S);
            Frame ->
                go_away(?PROTOCOL_ERROR, S)
        end,
    Response;
continuation(_, State) ->
    go_away(?PROTOCOL_ERROR, State).
#+END_SRC

So we're just checking here. If the socket times out after 10ms, come
back into this state again. If the frame read off the socket pattern
matches to the stream we're locked on, and it's a CONTINUATION frame,
route the frame, otherwise it's a protocol error.

So now,we have to route the continuation frame, but it's a stream
operation, so let's delegate it out to http2_stream:recv_frame

#+BEGIN_SRC erlang
route_frame(F={H=#frame_header{
                    stream_id=StreamId,
                    type=?CONTINUATION
                   }, _Payload},
            S = #connection_state{
                   streams = Streams
                  }) ->
    lager:debug("Received CONTINUATION Frame for Stream ~p", [StreamId]),
    {Stream, NewStreamsTail} = get_stream(StreamId, Streams),
    {NewStream, NewConnectionState} = http2_stream:recv_frame(F, {Stream, S}),
    NewStreams = [{StreamId,NewStream}|NewStreamsTail],

    NextState = case ?IS_FLAG(H#frame_header.flags, ?FLAG_END_HEADERS) of
                    true ->
                        connected;
                    false ->
                        continuation
                end,

    {next_state, NextState, NewConnectionState#connection_state{
                              streams = NewStreams
                             },0};
#+END_SRC

We'll just keep looping through here until we get that END_HEADERS
flag and find ourselves back in the continuation state. But if it has
the flag set, it's handled in the http2_stream and we just transition
back into the right state.

#+BEGIN_SRC erlang
-spec spawn_handle(
        pid(),
        stream_id(),     %% Stream Id
        hpack:headers(), %% Decoded Request Headers
        binary()         %% Request Body
       ) -> pid().
spawn_handle(Pid, StreamId, Headers, ReqBody) ->
    Handler = fun() ->
        handle(Pid, StreamId, Headers, ReqBody)
    end,
    spawn_link(Handler).

-spec handle(
        pid(),
        stream_id(),
        hpack:headers(),
        binary()
       ) -> ok.
#+END_SRC

Let's walk through that state diagram!

#+BEGIN_SRC plaintext
                             +--------+
                     send PP |        | recv PP
                    ,--------|  idle  |--------.
                   /         |        |         \
                  v          +--------+          v
           +----------+          |           +----------+
           |          |          | send H /  |          |
    ,------| reserved |          | recv H    | reserved |------.
    |      | (local)  |          |           | (remote) |      |
    |      +----------+          v           +----------+      |
    |          |             +--------+             |          |
    |          |     recv ES |        | send ES     |          |
    |   send H |     ,-------|  open  |-------.     | recv H   |
    |          |    /        |        |        \    |          |
    |          v   v         +--------+         v   v          |
    |      +----------+          |           +----------+      |
    |      |   half   |          |           |   half   |      |
    |      |  closed  |          | send R /  |  closed  |      |
    |      | (remote) |          | recv R    | (local)  |      |
    |      +----------+          |           +----------+      |
    |           |                |                 |           |
    |           | send ES /      |       recv ES / |           |
    |           | send R /       v        send R / |           |
    |           | recv R     +--------+   recv R   |           |
    | send R /  `----------->|        |<-----------'  send R / |
    | recv R                 | closed |               recv R   |
    `----------------------->|        |<----------------------'
                             +--------+

#+END_SRC

Path 1: easiest idle receives HEADERS with END_HEADERS AND END_STREAM!
decode headers, handle content, transition to closed

Path 2: idle receives HEADERS with END_STREAM, no END_HEADERS,
transition to half_closed_remote, wait for continuations until END
HEADERS, then decode headers, handle content, transition to closed.

Path 3: idle receives HEADERS with END_HEADERS, no
END_STREAM. transition to open and wait for DATA frames until one
comes with END_STREAM, then decode headers, handle content and
transition to closed.

Path 4: idle receives HEADERS, no END_STREAM or END_HEADERS transition
into open, expect continuations until one shows up with an
END_HEADERS, then expect DATA frames until one shows up with an
END_STREAM

%%Solid conclusion? Do I even need one?


#+BEGIN_SRC erlang
http2_connection:send_headers(ConnPid, StreamId, ResponseHeaders),
http2_connection:send_body(ConnPid, StreamId, Data),
NewStreamId = http2_connection:new_stream(ConnPid),
http2_connection:send_promise(ConnPid, StreamId, NewStreamId, PHeaders),
spawn_handle(ConnPid, NewStreamId, PHeaders, <<>>),

{ok, Ref} = prim_inet:async_accept(ListenSocket, -1),
#+END_SRC
