draft.html

<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34">continuation state</h3>
<div class="outline-text-3" id="text-orgheadline34">
<p>
Ok, so great, we're finally able to compensate for this HPACK mutex
business. Let me sum up the conditional logic again:
</p>

<p>
When a HEADERS frame comes in on stream N, the only frames that can be
accepted by the server are CONTINUATION frames on stream N until the
END_HEADERS flag is received.
</p>

<p>
Good news is, there's a trivial case: When the HEADERS frame also has
the END_HEADERS flag! That totally can happen. It all depends on frame
size limits and number of headers.
</p>

<p>
Here's what that route_frame looks like
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">route_frame</span>(<span style="color: #eab700;">F</span>={<span style="color: #eab700;">H</span>=#<span style="color: #4271ae;">frame_header</span>{
                  type=?<span style="color: #4271ae;">HEADERS</span>,
                  stream_id=<span style="color: #eab700;">StreamId</span>
                 }, <span style="color: #eab700;">_Payload</span>} = <span style="color: #eab700;">Frame</span>,
        <span style="color: #eab700;">S</span> = #<span style="color: #4271ae;">connection_state</span>{
               decode_context=<span style="color: #eab700;">DecodeContext</span>,
               recv_settings=#<span style="color: #4271ae;">settings</span>{initial_window_size=<span style="color: #eab700;">RecvWindowSize</span>},
               send_settings=#<span style="color: #4271ae;">settings</span>{initial_window_size=<span style="color: #eab700;">SendWindowSize</span>},
               streams=<span style="color: #eab700;">_Streams</span>,
               content_handler = <span style="color: #eab700;">Handler</span>
           })
</pre>
</div>

<p>
All we're doing here is figuring out with pattern matching "what bits
of state we'll need for this frame" and then we have a guard to check
"Did it have headers? Did it have the flag? Then it wasn't us"
</p>

<p>
I'm dropping a bunch more stuff on you here because I won't have time
to make a deeper dive on streams later. The connection keeps track of
all the open streams, what their state is, and flow control
information. Go read the code to learn more. Maybe talk tonight?
</p>


<div class="org-src-container">

<pre class="src src-erlang">Stream = <span style="color: #4271ae;">http2_stream</span>:<span style="color: #4271ae;">new</span>(<span style="color: #eab700;">StreamId</span>, {<span style="color: #eab700;">SendWindowSize</span>, <span style="color: #eab700;">RecvWindowSize</span>}),
{<span style="color: #eab700;">NewStream1</span>, <span style="color: #eab700;">NewConnectionState</span>} = <span style="color: #4271ae;">http2_stream</span>:<span style="color: #4271ae;">recv_frame</span>(<span style="color: #eab700;">Frame</span>, {<span style="color: #eab700;">NewStream</span>, <span style="color: #eab700;">S</span>}),
</pre>
</div>

<p>
Look, http2_stream:recv_frame is like a stream level version of
route_frame. It helps us manage the state of each stream from this
diagram.
</p>

<div class="org-src-container">

<pre class="src src-plaintext">                         +--------+
                 send PP |        | recv PP
                ,--------|  idle  |--------.
               /         |        |         \
              v          +--------+          v
       +----------+          |           +----------+
       |          |          | send H /  |          |
,------| reserved |          | recv H    | reserved |------.
|      | (local)  |          |           | (remote) |      |
|      +----------+          v           +----------+      |
|          |             +--------+             |          |
|          |     recv ES |        | send ES     |          |
|   send H |     ,-------|  open  |-------.     | recv H   |
|          |    /        |        |        \    |          |
|          v   v         +--------+         v   v          |
|      +----------+          |           +----------+      |
|      |   half   |          |           |   half   |      |
|      |  closed  |          | send R /  |  closed  |      |
|      | (remote) |          | recv R    | (local)  |      |
|      +----------+          |           +----------+      |
|           |                |                 |           |
|           | send ES /      |       recv ES / |           |
|           | send R /       v        send R / |           |
|           | recv R     +--------+   recv R   |           |
| send R /  `-----------&gt;|        |&lt;-----------'  send R / |
| recv R                 | closed |               recv R   |
`-----------------------&gt;|        |&lt;----------------------'
                         +--------+
</pre>
</div>

<p>
Let's dive in there for a minute, because otherwise we'd just have to
talk about error_handling
</p>

<p>
For the trivial case where a single headers frame comes in and it's
both the END of the header block AND the request, it looks pretty simple:
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">recv_frame</span>(<span style="color: #eab700;">F</span>={#<span style="color: #4271ae;">frame_header</span>{
                   flags=<span style="color: #eab700;">Flags</span>,
                   type=?<span style="color: #4271ae;">HEADERS</span>
                  }, <span style="color: #eab700;">_Payload</span>},
           {<span style="color: #eab700;">Stream</span>=#<span style="color: #4271ae;">stream_state</span>{
                      state=idle
                     },
            <span style="color: #eab700;">Connection</span>=#<span style="color: #4271ae;">connection_state</span>{
              decode_context=<span style="color: #eab700;">DecodeContext</span>,
              content_handler=<span style="color: #eab700;">Handler</span>
             }})
  <span style="color: #718c00;">when</span> ?<span style="color: #4271ae;">IS_FLAG</span>(<span style="color: #eab700;">Flags</span>, ?<span style="color: #4271ae;">FLAG_END_STREAM</span>),
       ?<span style="color: #4271ae;">IS_FLAG</span>(<span style="color: #eab700;">Flags</span>, ?<span style="color: #4271ae;">FLAG_END_HEADERS</span>) -&gt;
    <span style="color: #eab700;">HeadersBin</span> = <span style="color: #4271ae;">http2_frame_headers</span>:<span style="color: #4271ae;">from_frames</span>([<span style="color: #eab700;">F</span>]),
    {<span style="color: #eab700;">Headers</span>, <span style="color: #eab700;">NewDecodeContext</span>} = <span style="color: #4271ae;">hpack</span>:<span style="color: #4271ae;">decode</span>(<span style="color: #eab700;">HeadersBin</span>, <span style="color: #eab700;">DecodeContext</span>),
    <span style="color: #eab700;">Handler</span>:<span style="color: #4271ae;">spawn_handle</span>(<span style="color: #8959a8;">self</span>(), <span style="color: #eab700;">StreamId</span>, <span style="color: #eab700;">Headers</span>, &lt;&lt;&gt;&gt;),
    {<span style="color: #eab700;">Stream</span>#<span style="color: #4271ae;">stream_state</span>{request_headers=<span style="color: #eab700;">Headers</span>},
     <span style="color: #eab700;">Connection</span>#<span style="color: #4271ae;">connection_state</span>{
       decode_context=<span style="color: #eab700;">NewDecodeContext</span>
      }
     };
</pre>
</div>

<p>
There are a lot more clauses, but we won't have time to talk about
them right now. Don't be sad, I'm here all week!
</p>

<p>
We're doing two things in here, and really, those things just get
split up into different squares on that diagram.
</p>

<p>
First is decoding the headers.
</p>

<p>
Headers can be a list of frames, but in this case it's only one. It's
easier for us if it's a list of one, so we wrapped the frame in a
`[]`. Then we want to decode the binary. See how it takes in a Context
and returns a new one? That is the index that changes.
</p>

<p>
Second is handling the request.
</p>

<p>
This is just the content handler. In our case we're serving up files
as DATA frames, but we could and probably will write a webmachine
handler that could be used here as well.
</p>

<p>
Since we know this is an END_HEADERS, we don't even need to transition
into the continuation state. We don't need the mutex since we've
already met the target condition! We'll go set the NextState value
back at the connection level
</p>

<div class="org-src-container">

<pre class="src src-erlang">NextState = <span style="color: #718c00;">case</span> ?<span style="color: #4271ae;">IS_FLAG</span>(<span style="color: #eab700;">H</span>#<span style="color: #4271ae;">frame_header</span>.flags, ?<span style="color: #4271ae;">FLAG_END_HEADERS</span>) <span style="color: #718c00;">of</span>
                true -&gt;
                    connected;
                false -&gt;
                    continuation
            <span style="color: #718c00;">end</span>,
{next_state, <span style="color: #eab700;">NextState</span>, <span style="color: #eab700;">NewConnectionState</span>#<span style="color: #4271ae;">connection_state</span>{
                             streams = [{<span style="color: #eab700;">StreamId</span>, <span style="color: #eab700;">NewStream1</span>}|<span style="color: #eab700;">Streams</span>],
                             continuation_stream_id = <span style="color: #eab700;">StreamId</span>
                            }, 0}
</pre>
</div>

<p>
Since this was a new stream, we can just add it to the list. If it
weren't we'd have to remove the old one first so there could be only
one. Then we transition straight back to connected.
</p>

<p>
So, we make a new stream and throw it in the state. In the case where
we don't have an END HEADERS flag in our frame header (not a header
frame&#x2026; uggggg), then we transition to the continuation state. That's
it. It's off to Mutexburg, population: you!
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">continuation</span>(next,
             <span style="color: #eab700;">S</span> = #<span style="color: #4271ae;">connection_state</span>{
                    socket=<span style="color: #eab700;">Socket</span>,
                    continuation_stream_id = <span style="color: #eab700;">StreamId</span>
                   }) -&gt;
    <span style="color: #eab700;">Response</span> =
        <span style="color: #718c00;">case</span> <span style="color: #4271ae;">http2_frame</span>:<span style="color: #4271ae;">read</span>(<span style="color: #eab700;">Socket</span>, 10) <span style="color: #718c00;">of</span>
            {error, <span style="color: #eab700;">_</span>} -&gt;
                {next_state, continuation, <span style="color: #eab700;">S</span>, 0};
            <span style="color: #eab700;">Frame</span> = {#<span style="color: #4271ae;">frame_header</span>{
                     stream_id=<span style="color: #eab700;">StreamId</span>,
                     type=?<span style="color: #4271ae;">CONTINUATION</span>
                    }, <span style="color: #eab700;">_</span>} -&gt;
                <span style="color: #4271ae;">route_frame</span>(<span style="color: #eab700;">Frame</span>, <span style="color: #eab700;">S</span>);
            <span style="color: #eab700;">Frame</span> -&gt;
                <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">S</span>)
        <span style="color: #718c00;">end</span>,
    <span style="color: #eab700;">Response</span>;
<span style="color: #f5871f;">continuation</span>(<span style="color: #eab700;">_</span>, <span style="color: #eab700;">State</span>) -&gt;
    <span style="color: #4271ae;">go_away</span>(?<span style="color: #4271ae;">PROTOCOL_ERROR</span>, <span style="color: #eab700;">State</span>).
</pre>
</div>

<p>
So we're just checking here. If the socket times out after 10ms, come
back into this state again. If the frame read off the socket pattern
matches to the stream we're locked on, and it's a CONTINUATION frame,
route the frame, otherwise it's a protocol error.
</p>

<p>
So now,we have to route the continuation frame, but it's a stream
operation, so let's delegate it out to http2_stream:recv_frame
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #f5871f;">route_frame</span>(<span style="color: #eab700;">F</span>={<span style="color: #eab700;">H</span>=#<span style="color: #4271ae;">frame_header</span>{
                    stream_id=<span style="color: #eab700;">StreamId</span>,
                    type=?<span style="color: #4271ae;">CONTINUATION</span>
                   }, <span style="color: #eab700;">_Payload</span>},
            <span style="color: #eab700;">S</span> = #<span style="color: #4271ae;">connection_state</span>{
                   streams = <span style="color: #eab700;">Streams</span>
                  }) -&gt;
    <span style="color: #4271ae;">lager</span>:<span style="color: #4271ae;">debug</span>(<span style="color: #3e999f;">"Received CONTINUATION Frame for Stream ~p"</span>, [<span style="color: #eab700;">StreamId</span>]),
    {<span style="color: #eab700;">Stream</span>, <span style="color: #eab700;">NewStreamsTail</span>} = <span style="color: #4271ae;">get_stream</span>(<span style="color: #eab700;">StreamId</span>, <span style="color: #eab700;">Streams</span>),
    {<span style="color: #eab700;">NewStream</span>, <span style="color: #eab700;">NewConnectionState</span>} = <span style="color: #4271ae;">http2_stream</span>:<span style="color: #4271ae;">recv_frame</span>(<span style="color: #eab700;">F</span>, {<span style="color: #eab700;">Stream</span>, <span style="color: #eab700;">S</span>}),
    <span style="color: #eab700;">NewStreams</span> = [{<span style="color: #eab700;">StreamId</span>,<span style="color: #eab700;">NewStream</span>}|<span style="color: #eab700;">NewStreamsTail</span>],

    <span style="color: #eab700;">NextState</span> = <span style="color: #718c00;">case</span> ?<span style="color: #4271ae;">IS_FLAG</span>(<span style="color: #eab700;">H</span>#<span style="color: #4271ae;">frame_header</span>.flags, ?<span style="color: #4271ae;">FLAG_END_HEADERS</span>) <span style="color: #718c00;">of</span>
                    true -&gt;
                        connected;
                    false -&gt;
                        continuation
                <span style="color: #718c00;">end</span>,

    {next_state, <span style="color: #eab700;">NextState</span>, <span style="color: #eab700;">NewConnectionState</span>#<span style="color: #4271ae;">connection_state</span>{
                              streams = <span style="color: #eab700;">NewStreams</span>
                             },0};
</pre>
</div>

<p>
We'll just keep looping through here until we get that END_HEADERS
flag and find ourselves back in the continuation state. But if it has
the flag set, it's handled in the http2_stream and we just transition
back into the right state.
</p>

<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #8959a8;">-spec</span> <span style="color: #4271ae;">spawn_handle</span>(
        <span style="color: #8959a8;">pid</span>(),
        <span style="color: #4271ae;">stream_id</span>(),     <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Stream Id</span>
        <span style="color: #4271ae;">hpack</span>:<span style="color: #4271ae;">headers</span>(), <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Decoded Request Headers</span>
        <span style="color: #8959a8;">binary</span>()         <span style="color: #8e908c; font-style: italic;">%% </span><span style="color: #8e908c; font-style: italic;">Request Body</span>
       ) -&gt;<span style="color: #f5871f;"> </span><span style="color: #8959a8;">pid</span>().
<span style="color: #f5871f;">spawn_handle</span>(<span style="color: #eab700;">Pid</span>, <span style="color: #eab700;">StreamId</span>, <span style="color: #eab700;">Headers</span>, <span style="color: #eab700;">ReqBody</span>) -&gt;
    <span style="color: #eab700;">Handler</span> = <span style="color: #718c00;">fun</span>() -&gt;
        <span style="color: #4271ae;">handle</span>(<span style="color: #eab700;">Pid</span>, <span style="color: #eab700;">StreamId</span>, <span style="color: #eab700;">Headers</span>, <span style="color: #eab700;">ReqBody</span>)
    <span style="color: #718c00;">end</span>,
    <span style="color: #8959a8;">spawn_link</span>(<span style="color: #eab700;">Handler</span>).

<span style="color: #8959a8;">-spec</span> <span style="color: #4271ae;">handle</span>(
        <span style="color: #8959a8;">pid</span>(),
        <span style="color: #4271ae;">stream_id</span>(),
        <span style="color: #4271ae;">hpack</span>:<span style="color: #4271ae;">headers</span>(),
        <span style="color: #8959a8;">binary</span>()
       ) -&gt;<span style="color: #f5871f;"> </span>ok.
</pre>
</div>

<p>
Let's walk through that state diagram!
</p>

<div class="org-src-container">

<pre class="src src-plaintext">                         +--------+
                 send PP |        | recv PP
                ,--------|  idle  |--------.
               /         |        |         \
              v          +--------+          v
       +----------+          |           +----------+
       |          |          | send H /  |          |
,------| reserved |          | recv H    | reserved |------.
|      | (local)  |          |           | (remote) |      |
|      +----------+          v           +----------+      |
|          |             +--------+             |          |
|          |     recv ES |        | send ES     |          |
|   send H |     ,-------|  open  |-------.     | recv H   |
|          |    /        |        |        \    |          |
|          v   v         +--------+         v   v          |
|      +----------+          |           +----------+      |
|      |   half   |          |           |   half   |      |
|      |  closed  |          | send R /  |  closed  |      |
|      | (remote) |          | recv R    | (local)  |      |
|      +----------+          |           +----------+      |
|           |                |                 |           |
|           | send ES /      |       recv ES / |           |
|           | send R /       v        send R / |           |
|           | recv R     +--------+   recv R   |           |
| send R /  `-----------&gt;|        |&lt;-----------'  send R / |
| recv R                 | closed |               recv R   |
`-----------------------&gt;|        |&lt;----------------------'
                         +--------+
</pre>
</div>

<p>
Path 1: easiest idle receives HEADERS with END_HEADERS AND END_STREAM!
decode headers, handle content, transition to closed
</p>

<p>
Path 2: idle receives HEADERS with END_STREAM, no END_HEADERS,
transition to half_closed_remote, wait for continuations until END
HEADERS, then decode headers, handle content, transition to closed.
</p>

<p>
Path 3: idle receives HEADERS with END_HEADERS, no
END_STREAM. transition to open and wait for DATA frames until one
comes with END_STREAM, then decode headers, handle content and
transition to closed.
</p>

<p>
Path 4: idle receives HEADERS, no END_STREAM or END_HEADERS transition
into open, expect continuations until one shows up with an
END_HEADERS, then expect DATA frames until one shows up with an
END_STREAM
</p>

<p>
%%Solid conclusion? Do I even need one?
</p>


<div class="org-src-container">

<pre class="src src-erlang"><span style="color: #4271ae;">http2_connection</span>:<span style="color: #4271ae;">send_headers</span>(<span style="color: #eab700;">ConnPid</span>, <span style="color: #eab700;">StreamId</span>, <span style="color: #eab700;">ResponseHeaders</span>),
<span style="color: #4271ae;">http2_connection</span>:<span style="color: #4271ae;">send_body</span>(<span style="color: #eab700;">ConnPid</span>, <span style="color: #eab700;">StreamId</span>, <span style="color: #eab700;">Data</span>),
<span style="color: #eab700;">NewStreamId</span> = <span style="color: #4271ae;">http2_connection</span>:<span style="color: #4271ae;">new_stream</span>(<span style="color: #eab700;">ConnPid</span>),
<span style="color: #4271ae;">http2_connection</span>:<span style="color: #4271ae;">send_promise</span>(<span style="color: #eab700;">ConnPid</span>, <span style="color: #eab700;">StreamId</span>, <span style="color: #eab700;">NewStreamId</span>, <span style="color: #eab700;">PHeaders</span>),
<span style="color: #f5871f;">spawn_handle</span>(<span style="color: #eab700;">ConnPid</span>, <span style="color: #eab700;">NewStreamId</span>, <span style="color: #eab700;">PHeaders</span>, &lt;&lt;&gt;&gt;),

{ok, <span style="color: #eab700;">Ref</span>} = <span style="color: #4271ae;">prim_inet</span>:<span style="color: #4271ae;">async_accept</span>(<span style="color: #eab700;">ListenSocket</span>, -1),
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joe DeVivo</p>
<p class="date">Created: 2015-09-24 Thu 07:36</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
